[
  {
    "url": "https://www.changiairport.com/in/en/fly/arrival-guide/baggage-services.html",
    "title": "Baggage Services",
    "content": "Baggage Services BAGGAGE SERVICES Baggage Storage Visit our Baggage Storage counters if you need your baggage looked after while you shop hands-free or leave the airport comfortably. Find out more here Porter Services Porter services are available at all terminals to assist you with your baggage upon arrival or departure at Changi Airport. Find out more here Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 264
  },
  {
    "url": "https://www.changiairport.com/in/en/at-changi/terminal-guides/terminal-4.html",
    "title": "Terminal 4",
    "content": "Terminal 4 TERMINAL 4 Where innovation and efficiency come together seamlessly. About Terminal 4 T4 aims to serve a larger community of passengers, ensuring that our passengers can travel with ease of mind with greater travel options. T4 boasts environmentally friendly design elements with optimal use of natural lighting and energy management systems. In 2018, T4 won the Prix Versailles Architectural Award for South Asia and the Pacific as a testament to its state-of-the-art design. Attractions Unforgettable attractions await you at T4 Find out more Facilities Enhance your journey with top-notch facilities in T4 Find out more Services Lift your experience with superb services in T4 Find out more Retail Enjoy retail therapy with a side of affordable eats at T4 Find out more Dining Enjoy retail therapy with a side of affordable eats at T4 Find out more Happenings Catch the latest buzz and what's happening at T4 Find out more Airport Services at T4 FLIGHTS To/From T4 TRANSPORT WIFI MAP SPECIAL ASSISTANCE Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 371
  },
  {
    "url": "https://www.changiairport.com/in/en/fly/flight-information/freighter/arrivals.html",
    "title": "Arrivals",
    "content": "Arrivals Freighter Arrivals Keep track of arriving freighter flights with live updates. Arrivals Departures Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 221
  },
  {
    "url": "https://www.changiairport.com/in/en/at-changi/transport-and-directions/coach-to-johor-bahru.html",
    "title": "Coach to Johor Bahru",
    "content": "Coach to Johor Bahru COACH TO JOHOR BAHRU Going across the causeway is easy with these coach services to Johor Bahru. Travel seamlessly between Changi Airport and Johor Bahru with Transtar Cross Border Services, operated by Transtar Travel. Transtar Cross Border Coach Services to Johor Bahru TS1: Changi Airport—Johor Bahru CIQ (via Woodlands Checkpoint) ONE-WAY FARES TS1 Adult Child From Changi Airport to Johor Bahru CIQ S$11 S$5.50 From Johor Bahru CIQ to Changi Airport RM13 RM6.50 Book your coach tickets to Johor Bahru with https://www.transtar.travel/. Payment can be made in local currency (depending on boarding point) by cash or EZ-link card only. No change will be given and all tickets sold are non-refundable. SERVICE TIMINGS TS1 (6 daily return services) Service Timing First Bus from Changi Airport 8:15 AM Last Bus from Changi Airport 9:15 PM First Bus from Johor Bahru 5:00 AM Last Bus from Johor Bahru 7:15 PM CHANGI AIRPORT TS1 PICK-UP POINT Terminal 1 Arrival Coach Bay B / C Terminal 4 Arrival Coach Bay 7 / 8 If you are at Terminal 2 or 3, please make your way to Terminal 1 Arrival Hall Coach Bay to board the bus. Important Notes: Passengers are advised to wait at the pick-up point at least 10 minutes before the scheduled departure time. All times are approximate, and the schedules and routes are subject to change without notice due to traffic conditions, especially at respective Customs. Online schedule may differ from published schedules due to unexpected additional or removal of time slots. Please refer to Transtar Travel's website for the latest TS1 schedules. We recommend that you contact Transtar Travel at +65 6297 9009 to confirm your preferred departure time at least 24 hours prior to departure to avoid any delay. For more information, please approach Transtar Travel's counter (daily operating hours: 8:15 AM–5:00 PM) located at the Arrival Hall of Terminal 1 (#01-K2), or at any of the Information Counters located at the arrival halls. Other Links Getting to the Airport Leaving the Airport Transfer between Terminals & Jewel Shuttle Services Related Links Arriving Departing Transit Special Assistance Facilities and Services FREQUENTLY ASKED QUESTIONS ABOUT COACHES TO AND FROM JOHOR BAHRU How do I book a coach ticket from Changi Airport to Johor Bahru, and can I do it online? Booking a bus ticket online is straightforward and convenient. Simply visit the Transtar Travel website, and on the homepage, select whether you need a one-way or return ticket. Specify your departure from Changi Airport and your arrival in Johor Bahru (JB), then choose your travel date. Browse through the available coach services and select the one that best suits your schedule. Next, indicate the number of tickets you need and provide passenger details, including full name, mobile number, and email address. You'll also have the option to add travel personal accident insurance. Once all information is confirmed, proceed to make your payment to secure your booking. What are the departure times for coaches from Changi Airport to Johor Bahru, and how frequently do they run? Coaches from Changi Airport to Johor Bahru operate daily, with multiple departures spread from morning until night. Specifically, the first coach departs at 8:15 AM, and services continue with the last coach leaving at 9:15 PM. While there are several buses each day directly from Changi Airport, additional services are available from other pickup locations throughout Singapore, providing flexibility and convenience for travellers heading to Johor Bahru. What is the estimated travel time from Changi Airport to Johor Bahru by coach? The travel time from Changi Airport to Johor Bahru by coach generally takes about 2 hours. However, the duration can vary depending on traffic conditions and the time spent at customs and immigration checkpoints. Travellers should allow extra time for these variables, especially during peak travel periods. Are there any luggage restrictions or fees for luggage when travelling by coach to Johor Bahru? The allowable luggage is one piece weighing up to 15KG per person for storage in the luggage compartment, plus one hand-carry item weighing up to 7KG that can be taken onto the coach. How much does a coach ticket from Changi Airport to Johor Bahru cost? For Transtar Cross Border Services, an adult ticket costs S$11 when departing from Changi Airport to Johor Bahru CIQ. Children below 7 years old can enjoy half price rides at S$5.50. Where exactly do the coaches to Johor Bahru depart from within Changi Airport? Coaches to Johor Bahru depart from Changi Airport at the Arrival Coach Bay located at Terminal 1 pick-up point Bay B/C and Terminal 4 pick-up point Bay 7/8. If you are arriving or waiting in Terminal 2 or Terminal 3, you will need to make your way to Terminal 1's Arrival Hall Coach Bay to board your bus. Clear signage and information counters throughout the airport can assist you in finding this location easily. What are the v",
    "word_count": 1226
  },
  {
    "url": "https://www.changiairport.com/in/en/at-changi/facilities-and-services-directory/shower-and-spa-services.html",
    "title": "Shower and Spa Services",
    "content": "Shower and Spa Services Shower and Spa Services Rejuvenate your body with Changi Airport’s shower and spa facilities. Facilities Health & Wellness Location About FAQs All T1 T2 T3 Jewel PUBLIC TRANSIT Jewel Level1 #01-304 (next to Lift Lobby E) - Changi Lounge 06:00 - 22:00 Daily (last shower slot at 9.25PM) View On Map T2 Public Level1 Hub & Spoke 07:00 - 22:00 Daily View On Map T3 Public Level1 Arrival Meeting Hall - Natureland Spa 09:00 - 22:30 Daily View On Map T1 Transit Level3 Departure Transit Hall (near C Gates) - Plaza Premium Lounge Open 24 hours Daily View On Map T2 Transit Level3 Departure Transit Hall Central (near F Gates) - Ambassador Transit Hotel Open 24 hours Daily View On Map T3 Transit Level3 Departure Transit Hall - Ambassador Transit Hotel Open 24 hours Daily View On Map T3 Transit Level2 Departure Transit Hall - Be Relax Spa 08:00 - 23:00 Daily View On Map FEEL REFRESHED AND REVITALISED Rejuvenate after your long flight. Visit our paid lounges for shower facilities, nail care, foot reflexology and massage therapies. Charges apply for both lounge access and services. What are the operating hours of the shower and spa services at Changi Airport? Shower and spa facilities at selected Singapore Changi Airport airline lounges and pay per use lounges are open 24/7 so you can enjoy a refreshing break at any time of the day or night. Whether you're arriving from a long flight or have a layover, our facilities are designed for your convenience and comfort. For other shower and spa services outside of our 24/7 airport lounges, such as at Hub & Spoke, opening times may vary. Do I need to make a reservation for shower and spa services in advance? While reservations are not mandatory for shower facilities, we recommend booking in advance for spa facilities and massage therapies to ensure availability. Walk-ins are welcome, but availability cannot be guaranteed What types of spa treatments are offered at Changi Airport? Changi Airport offers a variety of spa treatments, including traditional massage therapies, foot reflexology, and back massages, designed to rejuvenate tired travellers. Our professional therapists are skilled in a range of techniques to help you relax and refresh before your next flight, ensuring you board your plane feeling refreshed and ready for your next adventure. Are the shower and spa facilities accessible to passengers with disabilities? Yes, the shower and spa facilities at Changi Airport are accessible to passengers with disabilities. Our facilities are equipped with features designed to ensure a comfortable and convenient experience for all passengers. If you are experiencing any difficulties with accessing any Changi Airport facilities, do reach out to our helpful airport staff for assistance. What amenities are provided in the shower and spa facilities? Selected shower facilities at Changi Airport come equipped with towels, soap, shampoo, and hairdryers. Additional amenities, such as toiletries and grooming kits, may also be available upon request, ensuring you have everything you need for a refreshing experience. Are there any age restrictions for using the shower and spa services? There are currently no age restrictions for using shower facilities in Changi Airport. For younger passengers wishing to use shower facilities, they must be accompanied by an adult. Parents or guardians of young passengers are also advised to take proper safety precautions in case of accidental slips or falls. There may be age restrictions for certain spa services, depending on the tenant providing the service. Generally, spa treatments are available to passengers aged 18 and above. Can I purchase gift vouchers for shower and spa services as a gift for someone else? Yes, gift vouchers for our shower and spa services are available via lounge or spa vouchers, respectively. Please contact the specific airport lounge or tenant for more information, or explore our exclusive travel deals and promotions for the latest offers. What payment methods are accepted for shower and spa services? All major credit cards, cash, and select mobile payment options are accepted for shower and spa facilities and services at Changi Airport. This ensures a hassle-free payment experience, allowing you to enjoy our facilities with ease. Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corp",
    "word_count": 899
  },
  {
    "url": "https://www.changiairport.com/in/en/experience/tours/free-singapore-tour.html",
    "title": "Free Singapore Tour",
    "content": "Free Singapore Tour Free Singapore Tour See Singapore in under 3 hours If you are transiting through this tiny island-state, turn your layover into an adventure with the Free Singapore Tour! For travellers with at least 5.5 hours to 24 hours to spare till your connecting flight, these 2.5-hour guided tours offer a perfect introduction to Singapore’s vibrant cityscape, rich heritage and iconic landmarks. Choose from four unique tour itineraries, each featuring curated sightseeing routes with two brief photo stops at iconic landmarks. TOUR ELIGIBILITY 1. Eligibility Requirements You are a transit or transfer passenger at Changi Airport. Your checked-in baggage should be through checked to your end destination. Your layover duration should be between 5.5 to 24 hours. Your flight schedule should meet the requirements of the tour timings (refer to Tour Schedules and Itineraries below). Please take note of the reporting time (refer to Tour Schedules and Itineraries below), and ensure there is sufficient time upon plane disembarkation to reach the registration counter. Transit passengers can only enter and exit Singapore once during their layover, in compliance with the regulations set by Immigration and Checkpoints Authority of Singapore. 2. How do I register? You can pre-book one (1) tour itinerary up to fifty (50) days prior to your intended tour date. Alternatively, you can visit our tour booth(s) in the transit area upon arrival for assistance. Please note that seats are subject to availability, and there may be a balance of seats for walk-in passengers. Upon arrival at Changi Airport, please remain in the transit area and refrain from clearing Arrival immigration as the Free Singapore Tour booths are located within the transit area. The Free Singapore Tour booths are located at: T2 TRANSIT Level2, Departure Transit Hall (Near Gate F50) Opening hours: 8:00 AM-6:00PM T3 TRANSIT Level2, Departure Transit Hall (Near Gate A1-A8) Opening hours: 8:00 AM-6:00PM 3. What do I need to join the tour? Passport, boarding passes, valid entry visa (if required) and tour booking confirmation are required for registration. Eligibility to participate in the tour is subject to entry requirements stipulated by the Immigration and Checkpoints Authority of Singapore. If you have bulky or wheeled cabin baggage, alcohol, or duty-free items, you must deposit them at a Baggage Storage counter in the transit area before checking in for the tour. Please note that fees apply for this service. Electronic devices are not permitted to be stored. They must be hand-carried during the tour. 4. Important Notes Seats are allocated on a first-come, first-served basis. Each transit passenger is permitted to reserve only one tour during their layover. Tour itineraries are subject to change, depending on weather and traffic conditions. Items such as Tobacco, cigarettes, vaporizers and e-cigarettes are not permitted on all tours, as the listed items are either banned or taxable upon entry into the Republic of Singapore. Sentosa Discovery Tour [NEW!] Experience Singapore’s southern coast and discover how Sentosa transformed from a former British military base into a vibrant leisure destination. Stay tuned! Launching on 1 August. Book Now City Sights Tour Experience the best of Singapore in this dynamic city tour! From awe-inspiring architectural wonders to lush green spaces, this tour offers a snapshot of what makes Singapore a world-class city. Book Now Singapore River and Marina Bay Sands Tour Trace Singapore’s transformation from a historic trading port to a futuristic city as you explore the iconic Singapore River and Marina Bay Sands. Book Now Heritage and Culture Tour Perfect for heritage and culture enthusiasts, this tour offers an immersive journey through Singapore’s storied past. Explore vibrant ethnic enclaves and discover a cultural diversity that defines this modern city. Book Now Book Now Tour timings and itineraries Tour Timing Tour Itinerary Reporting Time(at Booth) 10:00 AM - 12:30 PM Heritage and Culture Tour Before 8:30 AM 12:00 PM - 2:30 PM City Sights Tour Before 10:30 AM 1:00 PM - 3:30 PM Singapore River and Marina Bay Sands Tour Before 11:30 AM 3:00 PM - 5:30 PM Heritage and Culture Tour Before 1:30 PM 4:00 PM - 6:30PM1 Singapore River and Marina Bay Sands Tour Before 2:30 PM 5:00PM - 7:30PM2 Singapore River and Marina Bay Sands Tour Before 3:30 PM 6:00 PM - 8:30 PM City Sights Tour Before 4:30 PM 7:00 PM - 9:30 PM3 Sentosa Discovery Tour [NEW!] Before 5:30 PM 1Tour operates from 5 August 2025 onwards. 2Tour operates until 4 August 2025. 3Tour operates from 1 August 2025 onwards. Frequently Asked Questions​ ​1. Are the tours available every day? The tours are available daily, including weekends and public holidays. 2. When are the Free Singapore Tour booths open? The Free Singapore Tour booths are open daily. The operating hours are T2 Transit Level2, Departure Transit Hall (Near Gate F50) Opening hours: 8:00AM-6:00PM T3 TRANSIT",
    "word_count": 1814
  },
  {
    "url": "https://www.changiairport.com/in/en/fly/arrival-guide.html",
    "title": "Arrival Guide",
    "content": "Arrival Guide ARRIVAL GUIDE Begin your trip to Singapore with a​ smooth arrival​ at Changi Airport. Public Health & Entry Requirements Learn more about prevailing requirements to ensure a smooth journey to enter Singapore. Read more Immigration & Customs Learn about immigration procedures, visa requirements, and more. Read more Dutiable & Prohibited Items Know more about goods subject to customs duty and prohibited goods in Singapore. Read more Baggage Services Find out where you can get some rest after a long flight, or get help with your baggage. Read more Getting Started in Singapore Learn how to get to the city, book a hotel room, stay connected, and visit local attractions. Read more Passenger Meeting Services Experience a warm welcome and fond farewell with Changi Meet & Greet Services. Read more Useful information at your fingertips Track your bags, free your worries Receive timely updates about your baggage status and travel with greater peace of mind. Read more Seamless journey awaits Stay posted on all the ins and outs for Changi Airport with all the right information at a tap away. Read more Book ahead, skip the queues Redeem perks and purchase attraction tickets easily at any time! Read more All foreign visitors can now use automated lanes for immigration clearance at Changi Airport Read more Quick Links DEPARTING​ TRANSIT​ SPECIAL ASSISTANCE​ FACILITIES AND SERVICES​ TRANSPORT​ Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 433
  },
  {
    "url": "https://www.changiairport.com/in/en/fly/lounges.html",
    "title": "Lounges",
    "content": "Lounges Lounges Airport Lounges Need a quiet place to rest or catch up on work? Your airline might have an exclusive lounge facility Find out more here Pay-per-use Lounges Enjoy an elite travel experience at your leisure Find out more here Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 248
  },
  {
    "url": "https://www.changiairport.com/in/en/fly/flight-information/arrivals.html",
    "title": "Arrivals",
    "content": "Arrivals ARRIVAL FLIGHT LISTING Keep track of arriving passenger flights with live updates. Arrivals Departures Disclaimer Every effort has been made to ensure the information provided is correct. The dates, times and other details shown in the tables may, from time to time, be changed without notification. CAG and/or its agents, employees or contractors are not responsible for any incorrect information and are, therefore, not liable in any way for inaccuracies or errors. Users are advised to consult with airlines directly before travelling. Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 290
  },
  {
    "url": "https://www.changiairport.com/in/en/at-changi.html",
    "title": "At Changi",
    "content": "At Changi At Changi Get through Changi Airport seamlessly with our curated guides and enjoy a touch of magic with our attractions, facilities and services. Explore our terminals Enjoy what each terminal has to offer Terminal 1 Terminal 2 Terminal 3 Terminal 4 Airport Services Flight Information Transport Facilities Airport Map Lost & Found Free Wifi Access Find your way Travel to, from, and within Changi Airport with ease using our comprehensive transport guides. Getting to Changi Getting to Jewel Getting to other terminals Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 291
  },
  {
    "url": "https://www.changiairport.com/in/en/fly/flight-information.html",
    "title": "Flight Information",
    "content": "Flight Information FLIGHT INFORMATION Keep track of flight timings with live updates. Arrival Receiving a loved one or guest? Check if the flight is on schedule and what the belt number is. Departure Have a flight to catch? Check your terminal, boarding time and gate. Useful Links Flight Information Transport Facilities Airport Map Lost & Found Wifi Access FREQUENTLY ASKED QUESTIONS ABOUT CHANGI AIRPORT'S FLIGHT INFORMATION How can I check the status of my flight at Changi Airport? Visit the Changi Arrival flight or Changi Departure flight pages, or use the Changi App for real-time flight information, including any changes to your flight schedule. Digital boards throughout Changi Airport also display the latest flight timings and status updates, making it easy for you to stay on top of your travel plans. What should I do if my flight is delayed or cancelled? In the event of a delayed or cancelled flight, please check the latest flight status through our website or mobile app, where real-time updates are readily available. It is important to stay in touch with your airline, as they will have the most current information regarding rescheduling or compensation. Are there any restrictions or requirements for international travellers departing from Changi Airport? International travellers departing from Changi Airport should be aware that restrictions and requirements can vary depending on the destination country. We recommend checking our airport’s security screening process, as well as regulations outlined by the authorities of your destination country. It’s also crucial to check with your airline for any additional requirements, such as health certifications or pre-departure testing requirements. How early should I arrive at Changi Airport before my flight? For a smooth and stress-free departure, we suggest arriving at Changi Airport at least two hours for short-haul flights and three hours for long-haul flights. This allows sufficient time for check-in, immigration clearance, and security screening, in addition to enjoying the diverse range of attractions, airport eateries, popular outlets, and relaxation facilities available. Arriving early also ensures you can navigate any unforeseen delays with ease, ensuring a more relaxed start to your journey. What amenities and services are available at Changi Airport for travellers? From airport lounges and quiet rest areas to shopping and dining options, there's something for every traveller at Changi Airport. For those looking to relax before or after their flight, Changi also features beautiful gardens, a cinema, and even a swimming pool with a Jacuzzi. Information counters and customer service representatives are also readily available to assist with any travel needs or questions you might have. How can I contact customer support for assistance with flight bookings or inquiries? For assistance with flight bookings or inquiries, Changi Airport's customer support team is always ready to assist you. You can reach us through our mobile app or by calling our customer service hotline. Our dedicated team will provide you with the necessary support, from flight information and schedule changes to general airport inquiries, ensuring your travel experience is as seamless as possible. Are there language options or tools for non-English speaking users to access flight details? Changi Airport offers multiple language options on both our website and mobile app, ensuring everyone can easily access flight details and airport information regardless of their native language. Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 749
  },
  {
    "url": "https://www.changiairport.com/en/corporate.html",
    "title": "Corporate",
    "content": "Corporate Soar to new heights with us RECOMMENDED FOR YOU Leasing Opportunities Find out how we can help your business reach international audiences. Advertising Opportunities Showcase your brand at the world’s most awarded airport. Airline Partnerships Learn how we revolutionise airport retail with partners. ABOUT CHANGI AIRPORT GROUP Our Story & Beliefs Find out all you need to know about Changi and it’s rich aviation history. Learn more Our Subsidiaries Discover the array of subsidiaries and affiliates enriching our company’s ecosystem. Learn more Our Leaders Introducing the inspirational leaders who propel Changi Airport Group’s excellence and progress. Learn more What We Do Air Hub Development We strengthen Changi Airport's connectivity and attractiveness as a vibrant air hub. Read More Airport Operations and Management We manage the operational needs of Changi and Seletar Airports. Read More Retail Management We grow together with our concession partners through continuous innovation. Read More Systems & Technology We provide high quality airport infrastructure for the sustained development of Changi as a world-class air hub. Read More The World’s Most Awarded Airport Recognised awards to date 699 View All Awards Deficiency - Free 2023 International Federation of Air Line Pilots' Association 78th IFALPA Regional Conference 1981 - 2023 Best Airport by Size (over 40mil) and Region (Asia-Pacific) Airports Council International Airport Service Quality 2018 - 2023 Best Airport DestinAsian Readers' Choice Awards 2006 - 2020, 2022 - 2024 Latest News View All News Statistics Changi Airport’s operating indicators for Q2 2025 22 Jul 2025 Jewel Events SG60 celebrations take off at Changi Airport and Jewel with star-studded concert, charity walk, and a dazzling floral extravaganza 25 Jun 2025 Corporate CAI Changi Airport Group signs Memorandum of Understanding with Haikou Meilan International Airport to strengthen cooperation in aviation 16 Jun 2025 Corporate Changi Airport Group awards contract for the construction of Terminal 5’s intra-terminal tunnels 10 Jun 2025 Corporate Fact Sheet: Changi Airport 30 May 2025 Corporate Changi Airport Group results for the year ended 31 March 2025 24 May 2025 Partner with us Whether be it leasing, advertising or investing in the Changi Airport brand, we have an abundance of resources and opportunities for collaboration. See Our Consulting Portfolio Advertise With Us Lease With Us Learn More BUILD YOUR CAREER AT CHANGI CAREER QUICKLINKS Why Join Changi? We offer you the prestige and pride of working in a world-class environment, with abundant opportunities to learn and grow. Read more Meet Our Team At Changi Airport, different divisions come together to make our airport the world's most awarded. Read more About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Social Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 587
  },
  {
    "url": "https://www.changiairport.com/in/en/at-changi/terminal-guides/terminal-1.html",
    "title": "Terminal 1",
    "content": "Terminal 1 Terminal 1 A tropical city-inspired terminal with lush greenery and natural light. About Terminal 1 Terminal 1 started operations as Changi's first terminal in 1981. It has since undergone two upgrading and expansion projects. The latest design is based on the thematic concept of a ‘Tropical City’ and it reflects Singapore’s reputation as a garden city. Attractions Discover exciting experiences and must-see spots in T1 Find out more Facilities Enhance your journey with top-notch facilities in T1 Find out more Services Lift your experience with superb services in T1 Find out more Retail Splurge in exceptional shopping at T1 Find out more Dining Indulge in culinary delights at T1 Find out more Happenings Catch the latest buzz and what's happening at T1 Find out more AIRPORT SERVICES AT T1 FLIGHTS Hotel TRANSPORT WIFI MAP Special Assistance Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 345
  },
  {
    "url": "https://www.changiairport.com/in/en/fly/arrival-guide/immigration.html",
    "title": "Arrival Immigration",
    "content": "Arrival Immigration Immigration Clearance What to know and look out for, to clear immigration swiftly. Entry Requirements Automated Clearance IMMIGRATION PROCEDURES IMMIGRATION PROCEDURES All passengers (Singapore Citizens, Permanent Residents, Long-term Pass Holders and Foreign Visitors) who would like to enter Singapore are required to submit the electronic Health Declaration Card (eHDC) via the SG Arrival Card (SGAC) e-Service before clearing immigration. Please note that the paper-based disembarkation and embarkation card for arriving foreign visitors has been discontinued with effect from 27 March 2020. Foreign visitors will instead provide their arrival information via the SGAC e-Service instead. In addition to the submission of the eHDC, Long-term Pass Holders and Foreign Visitors are also required to have their passports and Permits / Entry Visas (if applicable) ready as well . If you are arriving within six days of passing through areas endemic for Yellow Fever, you may need to present a Fever Vaccination Certificate. Instructions for Submission of electronic Health Declaration Card (eHDC) You may submit the eHDC and SGAC via the SGAC e-Service at https://eservices.ica.gov.sg/sgarrivalcard, or via the myICA Mobile app which can be downloaded by scanning the QR code below: APP STORE GOOGLE PLAYSTORE Note to transiting passengers: If your airline does not provide a baggage transfer service, you are required to clear Arrival Immigration and claim your baggage before checking in for your next flight. VISA REQUIREMENTS Foreign visitors must get their Permits or Entry Visas ready before proceeding to immigration clearance. For more information on entry and visa requirements, please contact Immigration and Checkpoints Authority (ICA) via their 24-hour automated answering service at +65 6391 6100 or visit ICA's website. Automated Clearance AUTOMATED CLEARANCE SYSTEM All travellers, including first time visitors, can now enjoy automated clearance when arriving or departing from Changi Airport. No prior enrolment is required. Singapore Residents can also enjoy passport-less clearance at both Arrival and Departure Immigration. All travellers are eligible for passport-less immigration clearance when departing from Changi Airport. Travellers can use automated clearance as long as they hold a valid International Civil Aviation Organisation (ICAO) compliant passport. All travellers must submit their SG Arrival Card (SGAC) within three days before arrival. Submission of the SG Arrival Card (SGAC) is free of charge and should only be done via ICA’s official channels (ICA's SGAC e-Service or MyICA Mobile app). For more information, please refer to ICA's website. STEP-BY-STEP GUIDE TO USE AUTOMATED LANES STEP-BY-STEP GUIDE TO USE SPECIAL ASSISTANCE LANES TIPS FOR A SMOOTH ARRIVAL Pass through the Green Channel if you have no goods to declare. Pass through the Red Channel if you have goods to declare. Bulk baggage can be collected at the usual baggage claim area. If you have lost or damaged baggage, contact the handling agent representing your airline. Related Links Departing Transit Special Assistance Facilities And Services Transport OTHER LINKS Dutiable & Prohibited Items Lounge & Baggage Services Getting Started in Singapore Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 691
  },
  {
    "url": "https://www.changiairport.com/in/en/fly/dutiable-and-prohibited-items.html",
    "title": "Dutiable and Prohibited Items",
    "content": "Dutiable and Prohibited Items Customs Declaration Get updated on dutiable goods as well as prohibited items that you may not bring into Singapore. DUTIABLE GOODS PROHIBITED ITEMS DUTIABLE GOODS Under Singapore law, it is mandatory for arriving travellers to pay taxes to bring in cigarettes, tobacco products and all goods exceeding the duty-free concession and Goods and Services Tax (GST) relief. For more details, please refer to Singapore Customs. Dutiable Items If you are bringing dutiable goods into Singapore, declare them at the Customs Duty Office located in the middle of the baggage claim hall. Duties and GST can be paid there or via Customs@SG Web Application. If you fail to make an accurate and complete declaration of any goods with you that exceeds duty-free concession and GST relief, including goods carried on behalf of other persons, you can be fined and prosecuted in court. Tax Relief A 9% Goods and Services Tax (GST) is levied on all goods imported into Singapore. You may be granted tax relief for all new purchases (excluding liquor and tobacco) under certain conditions. Click here for more information on GST relief Duty Free Concession Travellers entering Singapore can enjoy duty free concession for liquors if: You are 18 years old or above; You have spent 48 hours or more outside Singapore immediately before arrival; You are not arriving from Malaysia; The liquor is for your own consumption and not prohibited from import into Singapore. PROHIBITED AND CONTROLLED ITEMS Here are some items that are not allowed into Singapore without proper authorisation. Ammunition Empty cartridges Live bullets Ornaments made from empty cartridges Bullet-shaped lighters Grenade-shaped lighters Armaments Firearms Stun guns Replica guns Antique guns Toy guns Gun-shaped lighters Martial Arts Equipment Knuckle duster Nunchaku Ninja shoku Ninja star Truncheon Miscellaneous Flick knife Butterfly knife Handcuffs Pepper spray Catapult Crossbow Other Controlled Items Items that may affect community health, public safety and animal life also require an import license or authorisation from the respective authorities for entry into Singapore. Here are some controlled items categorised under the respective authorities: Items Competent Authority Animals, birds and their by-products Plants, potting medium and organic fertilisers Ornamental fish Veterinary vaccines Veterinary micro-organisms and plant pests Pet food National Parks Board Tel: 1800 471 7300 www.nparks.gov.sg www.nparks.gov.sg/feedback Food of any kind, both raw and cooked (e.g., meat, seafood, fruits, vegetables, eggs and processed food products) Singapore Food Agency Tel: +65 6805 2871 www.sfa.gov.sg www.sfa.gov.sg/feedback Newspaper, books and magazines Films, video tapes, VCDs, DVDs and Blu-Ray discs CD/DVD-ROM and video games Telecommunication and radio communication equipment Walkie-talkies Info-communications Media Development Authority Tel: 1800 478 5478 www.imda.gov.sg info@imda.gov.sg Medicine products Other health products containing schedule poisons Health Sciences Authority Tel: +65 6213 0838 www.hsa.gov.sg hsa_info@hsa.gov.sg Ionising Radiation (IR) Irradiating Apparatus & Radioactive Material X-ray equipment, devices containing radioactive materials, ore or any substances containing radioactive materials above the exemption limit, etc. Non-Ionising Radiation (NIR)Irradiating Apparatus Ultraviolet sunlamps, microwave ovens, selected ultrasound equipment (including high intensity focused ultrasound device), laser equipment (including laser pointers above regulatory limit of 5 milli-Watt), etc. National Environment Agency (Radiation Protection & Nuclear Science Department) www.nea.gov.sg nea_rpnsd_tradenet@nea.gov.sg OTHER LINKS Arrival Immigration Departure Immigration Baggage Services Getting Started in Singapore Related links Departing Transit Special Assistance Facilities and Services Transport Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights ",
    "word_count": 748
  },
  {
    "url": "https://www.changiairport.com/in/en/at-changi/facilities-and-services-directory/explore-changi-airport-lounges-airline-lounges-information.html",
    "title": "Airline Lounges",
    "content": "Airline Lounges Airline Lounges Need a quiet place to rest or catch up on work? Your airline may have an exclusive lounge facility. Lounges T1 T2 T3 T4 FAQs Lounge Location British Airways Lounge Tel: +65 6214 4195 Location: Level 3, Departure Transit Hall Click here for more information Emirates Lounge Tel: +65 6543 3501 / +65 6543 3503 (After operating hours) Location: Level 3, Departure Transit Hall Click here for more information Marhaba Lounge Tel: +65 6546 4976 Location: Level 3, Departure Transit Hall Qantas Business Lounge Tel: +65 6543 8113 / +65 6543 8114 Location: Level 3, Departure Transit Hall Click here for more information Qantas First Lounge Tel: +65 6543 8113 / +65 6543 8114 Location: Level 3, Departure Transit Hall Click here for more information Qatar Airways Premium Lounge Tel: +65 6241 5184 Location: Level 3, Departure Transit Hall Click here for more information SATS Premier Lounge Tel: +65 6541 8500 Location: Level 3, Departure Transit Hall SATS Special Services Lounge Tel: +65 6541 1880 Location: Level 3, Departure Transit Hall SATS Premier Check-in Lounge Location: Level 2, Departure Hall Lounge Location SilverKris Lounge Tel:+65 6223 8888 (SIA 24 hours Contact Centre) Location: Level 3, Departure Transit Hall Click here for more information KrisFlyer Gold Lounge Tel:+65 6223 8888 (SIA 24 hours Contact Centre) Location: Level 3, Departure Transit Hall Click here for more information SATS Premier Lounge Tel: +65 6541 8885 Location: Level 3, Departure Transit Hall SATS Special Service Lounge Tel: +65 6541 1880 Location: Level 2, Departure Transit Hall SATS Premier Check-in Lounge Tel: +65 6589 0559 Location: Level 2, Departure Hall DBS Private Access Lounge Tel: +65 6543 3473 Location: Level 3, Departure Transit Hall Click here for more information SIA First Class Check in Lounge Tel: +65 6223 8888 Location: Level 2, Departure Hall Lounge Location Marhaba Lounge Tel: +65 6242 7512 Location: Unit #03-09A, Level 3, Departure Transit Hall SilverKris Lounge Tel: +65 6223 8888 (SIA 24 hours Contact Centre) Location: Level 3, Departure Transit Hall Click here for more information KrisFlyer Gold Lounge Tel: +65 6223 8888 (SIA 24 hours Contact Centre) Location: Level 3, Departure Transit Hall Click here for more information SATS Premier Lounge Tel: +65 6541 1280 Location: Level 3, Departure Transit Hall SATS Special Service Lounge Tel: +65 6541 1880 Location: Level 2, Departure Transit Hall DBS Private Access Lounge Tel: 1800 221 1818 (24hours hotline) Location: Level 3, Departure Transit Hall Click here for more information SIA First Class Check in Lounge Location: Level 2, Departure Hall Lounge Location Blossom – SATS & Plaza Premium Lounge For walk-in passengers, please refer to prevailing rates here. (Please note that massage services are temporarily unavailable.) Tel: +65 6581 3073 Location: Level 2M, Departure Transit Hall Cathay Pacific Lounge Location: Level 2M, Departure Transit Hall Click here for more information Are the airline lounges at Changi Airport accessible to all passengers, regardless of airline or ticket class? Most airline lounges at Singapore Changi Airport are designed to cater to passengers flying in premium classes or those holding elite status with specific airlines. However, selected lounges such as the DBS Private Access Lounges at Terminals 2 and 3, and Blossom – SATS & Plaza Premium Lounge at Terminal 4, also welcome guests who may not fit these prior criteria through paid access, credit card memberships, or lounge membership programmes. Passengers may also approach any pay-per-use lounge in Changi Airport to enjoy relaxation, leisure, business, and culinary amenities for a fee. How can I access the airline lounges at Changi Airport if I am not a premium or elite status passenger? If you're not flying premium or don't have elite status, you can still enjoy airline lounge access by purchasing a day pass, using eligible credit cards, or joining a lounge membership program. Some lounges may offer online booking options for convenience, allowing you to secure your spot before your travels. What amenities and services are typically offered in the airline lounges at Changi Airport? The airline lounges at Changi Airport offer a range of amenities designed to enhance your travel experience, including comfortable seating, complimentary food and beverages, shower facilities, Wi-Fi, workstations, and in some cases, spa and massage services. These facilities ensure that passengers can relax, dine, or work in comfort before boarding their next flight out of Singapore. Are there any restrictions or eligibility criteria for accessing the airline lounges, such as dress code or membership requirements? Access to airline lounges may be subject to certain restrictions or eligibility criteria, including dress code, membership in airline loyalty programs, or lounge membership schemes. It's advisable to check specific lounge policies in advance to ensure compliance and a smooth expe",
    "word_count": 1225
  },
  {
    "url": "https://www.changiairport.com/in/en.html",
    "title": "Airport",
    "content": "Airport HELLO FROM CHANGI GO PLACES YOU'VE DREAMED OF SG60 Celebrations Join the SG60 fun with a charity walkathon, local performance, lush blooms & a dazzling outdoor light-up for everyone! Your browser does not support HTML video. I AM ARRIVING ARRIVING DEPARTING TRANSITING VISITING USEFUL INFORMATION FOR {DIRECTION} PASSENGERS What’s Happening BLACKPINK WORLD TOUR <DEADLINE> IN SINGAPORE SPEND & WIN PROMOTION Spend S$60 at Changi Airport for a chance to win a pair of tickets. Outlet Deals Shop and save: check out the latest deals! Shop more when you fly! Shop and dine at participating transit stores to be rewarded with free Changi Return e-Vouchers. Kids' Activity Booklet Get an activity booklet when you dine with kids at selected outlets! Tea Time Deal Time Thumbnail New Tea-Time, Deal Time! Visit Changi Airport public areas and unwind with specially-curated tea-time deals. Explore cities we are flying to today View All Kyoto All about onsens & ryokans Rome Top things to see & do Surabaya Perfect for family fun Cebu Best nature activities await Phnom Penh A food journey Melbourne Best day trips Penang Top nature retreats Haikou Recommendations for you Addis Ababa Ethiopia travel guide Jeonju Charming cultural town Bahrain Must-do during your visit Busan Vibrant coastal city Ipoh Weekend getaway guide Sibu Off-the-beaten destination London Best day trips Tokyo Lesser-known spots to visit Amsterdam Hidden gems to visit Bangkok New things to do Jeju The Hawaii of South Korea Hong Kong Lesser-known attractions Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 450
  },
  {
    "url": "https://www.changiairport.com/in/en/at-changi/map.html",
    "title": "Map",
    "content": "Map Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 208
  },
  {
    "url": "https://www.changiairport.com/in/en/at-changi/special-assistance.html?linkedListSection=reduced-mobility",
    "title": "Special Assistance",
    "content": "Special Assistance SPECIAL ASSISTANCE As an inclusive airport, we provide a range of accessible facilities and services to make your travel experience extra comfortable. TRAVELLING WITH CHILDREN ASSISTANCE FOR PERSONS WITH REDUCED MOBILITY ASSISTANCE FOR PERSONS WITH INVISIBLE DISABILITY OTHER ASSISTANCE TRAVELLING WITH CHILDREN Baby Milk If your baby is travelling with you, you may bring expressed breast milk onboard the aircraft. If not, you need to store the milk in containers not exceeding 100ml. More × <h3>Baby Milk</h3> <p><strong>Q: My baby is not travelling with me. Am I allowed to bring my breast milk onboard?</strong></p> <p>If your baby is not travelling with you, we would strongly advise you to store the expressed breast milk into containers not exceeding 100ml. The containers must fit comfortably in a 1-litre resealable plastic bag. The personal LAGS items will be discarded if it is not within the permissible capacity. Nonetheless, these personal LAGS items will be subjected to additional checks at the Pre-Board Security Screening Area, prior to boarding the aircraft.</p> Strollers You may obtain one directly at any of our Information Counters across all terminals and Jewel. More × <h3>Strollers</h3> <p>Changi Airport offers complimentary use of baby strollers, on a first-come-first-served basis. You may approach the information counters to obtain one, or click <a href=\"https://changiairportbooking.com/v2/#book\"><strong>h<u></u>ere</strong></a> to book (this link leads to an external booking platform). Strollers are also available for loan at the concierge counters in Jewel. Do note that a nominal refundable deposit is required and the strollers have to be returned at 9:30 PM.</p> Family Facilities From playgrounds to baby care rooms, we have all you need to entertain and take care of your kids. Find out what we offer at each terminal. More Unaccompanied Minor Service If your child is below the age of 12 and travelling alone, you can contact your airline for unaccompanied minor service. Refer to our Airlines page for contact details. More ASSISTANCE FOR PERSONS WITH REDUCED MOBILITY Using personal mobility equipment More × <p><strong>Using personal mobility equipment</strong></p> <p>If you are planning to travel with your own personal mobility equipment, do contact your airline in advance to make the necessary arrangements. Your airline will also advise on personal mobility equipment accepted on different aircrafts, things to note when checking-in your personal mobility device, as well as time for you to be present for check-in if you are using your personal mobility equipment to the boarding gate. Find your airlines’ contact&nbsp;<a href=\"https://www.changiairport.com/en/fly/airline-information/passenger.html\"><strong>here</strong></a>.</p> <p><br _rte_temp_br=\"brEOB\"> <br> </p> Wheelchair options available More × <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"682\"> <tbody><tr><td width=\"386\" valign=\"top\"><p>At Changi, there are a range of options available to meet the specific travel needs of all passengers with reduced mobility. Choose the option that best meets your needs.</p> <p>&nbsp;</p> <p><strong>Complimentary self-assist wheelchair by Changi Airport</strong></p> <p>Changi Airport offers complimentary self-assist wheelchairs across our 4 terminals, for use by our passengers and airport visitors. These wheelchairs may be loaned from information counters at each terminal’s departure hall, transit area, and arrival hall. These wheelchairs are available for airport-use only, on a first-come-first-served basis. If you require a wheelchair before they are replenished at the information counters, please contact the staff or virtual agent at the counter to arrange a wheelchair for you. You may also click <a href=\"https://changiairportbooking.com/v2/#book\"><strong>here</strong></a> to book a complimentary wheelchair ahead of your arrival at Changi Airport.</p> <p>Complimentary wheelchairs are also available for loan at Jewel Changi Airport. You may find them at Jewel’s concierge counters.</p> <p>&nbsp;</p> <p><strong>Wheelchair service by your airline</strong></p> <p>All airlines offer wheelchair service to their passengers. To ensure your request is met by your airline, you are encouraged to book the wheelchair service from your airline and/or travel agent when you book your flight, up to at least <strong>48 hours</strong> before flight departure. Please contact your airline for assistance for requests made less than 48 hours before your flight departs.</p> <p>Airlines may facilitate passengers with differing degrees of reduced mobility according to their needs. Your airline’s Special Assistance staff may ask if you are able to walk short distances. Please note that this helps to identify the level of assistance you require, so that you can be served better. During periods of high service demand, some waiting time may also be expected for the airline’s wheelchair service.</p> <p>Addi",
    "word_count": 2535
  },
  {
    "url": "https://www.changiairport.com/in/en/fly/airline-information.html",
    "title": "Airline Information",
    "content": "Airline Information AIRLINE INFORMATION Get contact information and check-in details of airlines at Changi Airport. Passenger Airline Information Contact and check-in details of passenger airlines at Changi Airport. View more Freighter Airline Information Contact details of freighter airlines at Changi Airport. View more IMPORTANT NOTE FOR PASSENGERS Please proceed to your airline's regular check-in counter if any of the following applies to you: 1. You are a passenger on staff travel or standby tickets 2. You are a passenger with a flight change request 3. You are a passenger with excess baggage or a ticketing issue 4. You are part of a single booking with more than 7 passengers Early Check-in Enjoy more time at the airport by checking in early. Baggage Restrictions Pack only permissible items in your cabin luggage. Shop Online Enjoy up to 50% off. Save more when you purchase our bundles today! Save flights, travel effortlessly Check flight information and receive real-time notifications while making full use of Changi’s travel services. Get the Changi App now FREQUENTLY ASKED QUESTIONS ABOUT AIRLINES AT CHANGI AIRPORT How can I contact airlines for booking assistance or inquiries? To contact airlines at Singapore Changi Airport for booking assistance or general inquiries, you can search for their contact information provided in our updated airlines directory. Phone numbers, email addresses, and chat options to connect with customer service are provided, where possible, offering you flexibility in reaching out to your airline of choice. Additionally, most airlines have customer service counters at Changi Airport, where you can speak to representatives in person. What are the check-in options available for flights at Changi Airport? Check-in at Changi Airport is made easy with our various flexible, flyer-focused check-in options! These include traditional staffed check-in counters, FAST self-service check-in kiosks, and online check-in available through specific airlines’ website or mobile app. For added convenience, early or city check-in services are also available for passengers of some airlines, allowing you more time to enjoy the facilities, services, and retail and dining options at Changi Airport and Jewel. Can I find information about special assistance services provided by airlines? Yes, you are recommended to inquire directly with an airline to find out more about their specific special assistance services. Each airline at Changi Airport provides specific services for passengers with disabilities, unaccompanied minors, or those needing special medical attention. It is advisable to arrange these services in advance by contacting the airline directly prior to your flight or travel date. What are the baggage allowances and restrictions for different airlines? Baggage allowances and restrictions vary significantly between airlines and depend on the class of travel and destination. Detailed information about baggage policies for each airline operating at Changi Airport can be found on their respective websites or by contacting them directly through their customer service channels. Checking this information before your trip can help prevent any issues at the airport during check-in for your flight. How do I access lounge facilities offered by airlines at Changi Airport? Airline lounge access at Changi Airport is typically available to passengers travelling in premium classes or those holding certain frequent flyer status. Additionally, some lounges offer paid access to all passengers regardless of their travel class. Travellers may also head to such pay-per-use lounges across Changi Airport to enjoy amenities such as shower facilities, dining options, and rest areas. Information about airline lounge locations, access policies, and facilities can be found on the Changi Airport website or by inquiring directly with the airline. How do I find information about flight delays, cancellations, or disruptions? To find information about airline flight delays, cancellations, or disruptions, you can check the Changi Airport Departures and Changi Airport Arrivals websites for real-time status updates. Changi Airport also offers a mobile app that provides real-time updates on all airline flights, including any changes in scheduling or last-minute disruptions. Staying informed through these channels can help you manage your travel plans effectively in case of any unforeseen events. Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Cont",
    "word_count": 868
  },
  {
    "url": "https://www.jewelchangiairport.com/zh.html",
    "title": "Experience Wonder at Jewel Changi Airport",
    "content": "Experience Wonder at Jewel Changi Airport [注意事项] 由于私人活动，请注意以下事项: • 星耀樟宜虚拟现实恐龙之旅将于 7 月 30 日至 8 月 1 日期间暂停开放。 • 森林谷将于 7 月 30 日至 8 月 1 日期间部分关闭。 • 樟宜时空体验馆将于8月1日下午5点至8点关闭（最后入场时间为下午4点）。 • 8月1日的水舞声光秀将取消。 • 除樟宜时空体验馆外，所有星耀樟宜景点将于9月6日关闭。 Your browser does not support the video tag. 探索星耀樟宜 发觉清新绿植与都会活力的完美结合 星空花园 一站式的娱乐休闲乐园 餐饮 尽情享受 星耀樟宜餐厅的各种美食选择 购物 世界级的购物体验在星耀樟宜等着您！ 住宿 在亚洲首家 YOTELAIR 酒店放松身心，恢复活力，焕然一新！ 全部花园与景点 最新促销 抓住最新优惠 查看更多 富翁体验赢在樟宜 星耀樟宜特权 JUST BETWEEN US FRIENDS 所有商店 最新促销 抓住最新优惠 查看更多 周一至周四 2 小时免费停车优惠活动 星空花园促销 SPEND AND WIN BIG 2024 WITH CAPITASTAR 星耀樟宜推荐 星耀樟宜独家节目 查看更多 提前值机优惠 星耀樟宜双份奖励 星耀樟宜礼遇 星耀樟宜推荐 星耀樟宜独家节目 查看更多 星耀樟宜会场 星耀樟宜婚礼场地 前往星耀樟宜 旅客指南 入境 出境 旅客须知 樟宜贵宾室 星耀樟宜礼遇 欢迎莅临星耀樟宜 观看视频 ×Close 关注星耀樟宜 掌握最新动态 订阅 关于星耀樟宜 职业机会 媒体资讯 联系我们 旅客须知 举报 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. 使用条款 隐私声明 Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue 您一旦使用本网站，意味着您已同意我们的 隐私声明、 使用条款 和向您的计算机发送Cookie的Cookie政策。",
    "word_count": 146
  },
  {
    "url": "https://www.jewelchangiairport.com/en/JewelGuidedTours.html",
    "title": "Jewel Guided Tours",
    "content": "Jewel Guided Tours [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. Key Facts Connected to T1, T2 and T3 Hotel facilities 2,500 car park spaces Accessible from Changi Airport MRT station Discover Jewel Tour Embark on a learning journey to uncover lesser-known facts about Jewel and the exciting offerings available to everyone! Find out how Jewel enhances travellers’ experiences with services such as early check-in facilities and the various offerings at Changi Lounge. Get to learn more about the curation behind the retail offerings available at Jewel! Experience a wondrous world at the exciting Canopy Park with first-of-its-kind play attractions suitable for the young and the young-at-heart. Look forward to a leisure stroll along  one of the two walking trails in the lush Forest Valley while enjoying breath-taking views of the Jewel Rain Vortex. For individual bookings, please register here. For schools or corporate bookings and enquiries, please email guidedtour@jewelchangiairport.com. *Minimum 20 pax for school groups and 10 pax for corporate groups. ×Close 4 / 9 Information 1 hour 30 mins (approx.) Minimum 10 pax From $45 per pax Tour is conducted in English and Mandarin STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 335
  },
  {
    "url": "https://www.jewelchangiairport.com/en/amenities-services.html",
    "title": "Amenities & Services - Jewel Changi Airport",
    "content": "Amenities & Services - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. Amenities & Services Enjoy a pleasant and hassle-free experience, with a suite of facilities and services tailored for every visitor. ATM, Money Exchange & Services Withdraw money or perform other banking transactions at the ATMs located at B1 and L4. B1: - FXChange: #B1-K200 & #B1-K206 - UOB: #B1-K201 & #B1-K208 - OCBC: #B1-K203 - DBS: #B1-K204 - ICBC: #B1-K207 - Citibank: #B1-K209 L4: - FXChange: #04-K200 Baby Care Baby Care (nursing) rooms are conveniently located on every level from B2 to L4. Amenities include: - Diaper changing stations - Hot & cold water dispensers - Private cubicles for nursing Baggage Storage Don't be bogged down by your hand-carry luggage. The Baggage Storage service* at L1 allows you to explore Jewel unencumbered, while your belongings are safely kept for you. Do note that several Jewel attractions do not permit luggage to be brought in with you. Find out more here. *Charges apply Car Services Find a full range of car grooming services including Hydroshot car wash, waxing, aircon cleaning, etc at CARs International located at #B3-K200 from 10am - 7pm. Find out more here. Concierge Services Approach our Experience Concierges for assistance, and a variety of other services. Counter is located at L1. Currency Exchange You can buy major currencies from the FXCHANGE kiosks at B1 and L4. Early Check-in Want to explore Jewel before you depart Singapore?  Simply come earlier and make use of the early check-in facilities at L1. There, you can check-in your baggage and enjoy a hands-free experience at Jewel before it is time to catch your flight. Click here for more information. Free WIFI Services Search for #WiFi@Jewel to access our free WiFi. GST Refund Claim your Goods and Services Tax refunds before you leave Singapore, from the Electronic Tourist Refund self-help (eTRS) kiosk at L1. Please have your passport, plane tickets, receipts and purchased items with you for a smooth process. Note: eTRS kiosk operates between 12.00pm - 8.00pm. Mobility Services Wheelchairs and strollers are available for loan* for added mobility when you explore Jewel. Available at the Concierge counter at Level 1, from 10am to 9.30pm daily.  Please note that some attractions are not accessible to wheelchairs or strollers. *A nominal refundable deposit is required Pharmacy Pick up last-minute wellness supplies or medication for peace of mind during your vacation. From off-the-shelf medication to sunscreen and diapers, the pharmacy at B2 provides for your family needs. Power Bank Loan Keep your mobile phones charged and ready - Create an account with the service provider at the Experience Concierge on L2 Taxi and Private Hire Car Taxis are available for hire at Basement 1 of Terminal 1. All fares are metered, and you may find more details on additional Airport Surcharges here. Booking of taxis via taxi and ride hailing apps are unavailable. Make a booking via the respective ride-hailing providers’ mobile application by selecting ‘Jewel Level 2 Pick-up Bay’ as your pick-up/drop-off location. Taxi bookings are unavailable out of Jewel. Electric Vehicle Charging Six Electric Vehicle (EV) charging stations are available in the Terminal 1/Jewel car park offering paid charging service for all electric vehicle drivers. Location: T1/Jewel car park, B3, Lobby C, parking spaces 207-212 Charger type: 22 kW AC Charging rates: Drivers need to download SP Utilities app before they are able to charge their EVs. Prevailng charging rates apply. Note to drivers: Please move your EV to another carpark space within 30mins after it is fully charged, to enable other drivers to use the charging stations. Additional charges may be imposed for cars which continue to be parked in the EV charging spaces beyond this grace period. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 771
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/bouncing-net.html",
    "title": "Bouncing Net - Jewel Changi Airport",
    "content": "Bouncing Net - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. ×Close BOUNCING NET FEEL LIKE YOU'RE BOUNCING AMONG TREES Experience the thrill of being almost weightless as you leap about this giant net! At its highest point at 8 metres above the ground, you'll feel like you can reach the sky. OPENING HOURS 10:00AM - 9:00PM Last admission is 30 mins prior to closing time LOCATION Canopy Park (L5) Practical information Recommended attire: - Pants or shorts - Comfortable covered shoes Luggage and wheeled bags are not allowed for safety reasons. Please leave your bags at the Baggage Storage. Bouncing Net Bouncing Net^# ticket includes admission to Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk). Standard Rate Adult - SGD 24.90 Child - SGD 19.90 Singapore Residents* Adult - SGD 20.90 Child/**Student/Senior - SGD 15.90 CapitaStar Members & Changi Rewards Members Special Rate [Available at Jewel Concierge Counters (L1, 2, 5)] Adult - SGD 18.80 Child/**Student/Senior - SGD 14.30 Child: 3 - 12 years old | Senior: 60 years old and above All Child ticket holders must be accompanied by a paying Adult. #Minimum height requirement is 110cm. ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. * Applicable for Singapore citizens, permanent residents, employment pass, work permit and dependent pass holders. Proof of residency may be required at the point of ticket purchase and upon admission. **Current students of local Universities, Polytechnics, Junior Colleges, Institutes of Technical Education and Secondary School holding a valid student photo ID are eligible to purchase student ticket. Verification will be done at the point of entry. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 2 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# 6. Bouncing Net^# Standard Rate Adult - SGD 54  |  **Child - SGD 39 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 4 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# 7. Bouncing Net^# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 71  |  **Child - SGD 50 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES *Terms and Conditions apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 665
  },
  {
    "url": "https://www.jewelchangiairport.com/en/getting-to-jewel.html",
    "title": "Getting to Jewel - Jewel Changi Airport",
    "content": "Getting to Jewel - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. GETTING TO JEWEL This iconic landmark is situated at the heart of Changi Airport and easily accessible to all terminals of the airport. Jewel is open 24hrs. Most shops operate between 10am to 10pm. Selected shops have extended operating hours. *Please check the directory listing for specific operating hours. Jewel Changi Airport 78 Airport Boulevard Singapore 819666 From Changi Airport T1 T2 T3 T4 From Terminal 1 Jewel is connected to the Arrival Hall (level 1) of Terminal 1. From Terminal 2 Jewel is a 5 to 10-minute walk via a link bridge from the Departure Hall (level 2) of Terminal 2 (near row 1). From Terminal 3 Jewel is a 5 to 10-minute walk via a link bridge from the Departure Hall (level 2) of Terminal 3 (near row 11). From Terminal 4 Take the free shuttle bus from Terminal 4 Arrival Lounge to Jewel/ Terminal 1  (opposite Jewel Level 2 Drop-off point). Direct shuttle bus service (T4 - Jewel) is available from 6am to 12am daily, while loop bus service (T4 - T3 - T1 - T4) is available from 1am to 6am daily. Direction ×Close 1 / 9 By Private Car/Taxi From the City Centre: • 20-minute drive via East Coast Parkway (ECP), which leads into Airport Boulevard. From Woodlands Checkpoint • 30-minute drive via Tampines Expressway (TPE) and Seletar Expressway (SLE) From Tuas Checkpoint • 40-minute drive via the East Coast Parkway Expressway (ECP) and Ayer Rajah Expressway (AYE) Motor Vehicles (including Vans): • Short-term Parking (B2M and B2) First 90 mins: S$0.65/15 mins block Subsequent 30 mins or part thereof S$5/30mins • General Parking (B3 to B5) S$0.65/15 mins block Motorcycles & Scooters: •     S$1.40 per day (7:00am to 6:59am next day) ×Close 1 / 9 By Train Take the Mass Rapid Transport (MRT) to the Changi Airport Station (CG2). Upon exiting the station (CG2), Jewel is accessible via link bridges located at level 2 of Terminals 2 and 3. Using the East-West (Green) Line Take a train to the Tanah Merah (EW4) station and cross the platform to transfer to an Airport-bound train. Using the Downtown (Blue) Line Take a train to the Expo (DT35) station. From here, transfer to the East-West (Green) Line eastward to the Changi Airport station (CG2). Upon exiting the station, Jewel is accessible via link bridges located at level 2 of Terminals 2 and 3. ×Close 1 / 9 By Bus The following Bus Services will stop at Terminal 1’s basement bus bay: • 24 • 27 • 34 • 36 • 53 • 110 • 858 Upon arrival at Terminal 1, please follow the signs to Jewel from Level 1 of the terminal. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 609
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/walking-net.html",
    "title": "Walking Net - Jewel Changi Airport",
    "content": "Walking Net - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. ×Close WALKING NET BALANCE YOUR WAY THROUGH AN ADVENTURE Suspended across a void, this is one walk you won't forget. A taut web 25 metres above ground affords an indescribable sensation of lightness. OPENING HOURS 10:00AM - 9:00PM Last admission is 30 mins prior to closing time LOCATION Canopy Park (L5) Practical information Recommended attire: - Pants or shorts - Comfortable covered shoes Luggage and wheeled bags are not allowed for safety reasons. Please leave your bags at the Baggage Storage. Walking Net Walking Net# ticket includes admission to Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk). Standard Rate Adult - SGD 18.90 Child - SGD 13.90 Singapore Residents* Adult - SGD 15.90 Child/**Student/Senior - SGD 10.90 CapitaStar Members &  Changi Rewards Members Special Rate [Available only at Jewel Concierge Counters (L1, 2, 5)] Adult - SGD 14.30 Child/**Student/Senior - SGD 9.80 Child: 3 - 12 years old | Senior: 60 years old and above All Child ticket holders must be accompanied by a paying Adult. # Minimum height requirement is 110cm. * Applicable for Singapore citizens, permanent residents, employment pass, work permit and dependent pass holders. Proof of residency may be required at the point of ticket purchase and upon admission. **Current students of local Universities, Polytechnics, Junior Colleges, Institutes of Technical Education and Secondary School holding a valid student photo ID are eligible to purchase student ticket. Verification will be done at the point of entry. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 1 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# Standard Rate Adult - SGD 39  |  **Child - SGD 29 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult #Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 2 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# 6. Bouncing Net^# Standard Rate Adult - SGD 54  |  **Child - SGD 39 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 3 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 56  |  **Child - SGD 40 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 4 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# 7. Bouncing Net^# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 71  |  **Child - SGD 50 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES *Terms and Conditions apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placem",
    "word_count": 827
  },
  {
    "url": "https://www.jewelchangiairport.com/en/search.html?q=Attractions",
    "title": "Search Result - Jewel Changi Airport",
    "content": "Search Result - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. ×Close Search 10 results found for “Attractions” Canopy Park A recreational playground for everyone Attractions The first-of-its-kind play attractions at Jewel Changi Airport promise endless fun for the young and young at heart! Discover a wondrous world where nature meets retail. Attractions Buyout Canopy Park Ticket Promotions - Jewel Changi Airport Canopy Park Terms & Conditions Exclusive Deals For Transit Passengers! Enjoy 20% off Canopy Park attractions when you flash this page at Jewel's Level 1 Concierge Counter! Changi Experience Studio A journey of fun and discovery Bouncing Net Feel like you're bouncing among trees Walking Net Balance your way through an adventure Foggy Bowls Play amongst the clouds Load More STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 274
  },
  {
    "url": "https://www.jewelchangiairport.com/en/promotion/eCapitaVoucher.html",
    "title": "Use Your eCapitaVoucher Now! - Jewel Changi Airport",
    "content": "Use Your eCapitaVoucher Now! - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. Use Your eCapitaVoucher Now LOCATION Participating Outlets ×Close 4 / 9 eCapitaVoucher is now accepted at Jewel Changi Airport! Redeem your eCapitaVoucher with STAR$ and use it at the participating outlets to offset your purchases! Terms and Conditions - Shoppers must be a CapitaStar Member to use eCapitaVouchers. - Only eCapitaVoucher (the digital form of CapitaVouchers) can be used at participating outlets in Jewel Changi Airport. - eCapitaVoucher can be used at participating Jewel Changi Airport outlets, except the following non-participating outlets: Arabica % 01-K208 A&W B2-209 Apple 02-234/235/236 AwHsome by Hyggerium 02-214 Birds of Paradise Gelato Boutique 01-214/215/216 Birkenstock B1-229 Beryl's Chocolate #B2-212 Challenger B2-214/215 Columbia 02-241 Coucou Hotpot.Brew Tea 02-208/209 DESCENTE 02-220/221/222 Din Tai Fung 03-214/215 Dragon Brand Bird's Nest 03-210 Don Don Donki B1-224 Dyson Demo Store Service Centre 02-224/225 Fong Sheng Hao B2-232 Frozen Heart Fried Ice Cream B2-258 Funclaw 04-206/207 Gelatissmo 03-206 Guzman Y Gomez #B2-211 Gift by Changi Airport 04-233 Goelia B1-250 Goelia Since 1995 B1-291 HOOGA B1-217/218 Ipoh Town B1-299 Jolly Fields by Zoomoov 04-225 POP UP! JUMP CHARACTERS STORE in Singapore 04-235/236 Kantin 05-206/207 Kcuts B2-204 Kee Wah Bakery B2-252 Kei Kaisendon 03-213 Keong Saik Bakery 01-K214 Kenangan Coffee B2-255 KOI Express B2-263 Lavender B2-253/254 Laderach Chocolatier Suisse 01-241 Le Petit Society B1-292 Luckin Coffee 04-231/232 Mamma Mia Trattoria E Caffè 04-200 McDonald's B1-298 Minmed Wellness Collective 04-209/210/211/212 Nectar Life | Pearl de Flore B1-295/296 Naixue B1-243 Nasty Cookie 03-207 Natureland Spa. Premium 04-215-217 New Era 02-238 Nintendo Pop-Up Store in Singapore 04-227 Otaku House 04-240 Polo Ralph Lauren 01-258 Poulet Bijou 01-227 Queic by Olivia 01-k218 Sanrio Characters Pop-Up Store 04-220/221 Salomon #02-242 Satellite Paris B1-207 Setirom B1-208/209 SkinGO! B2-203 Smiggle B1-202/203 Snack Box 03-205 Sourbombe Artisanal Bakery 02-237 Tambuah Mas Indonesian Restaurant 03-225/226 Tai Er 03-208 The Backyard Bakers 01-234 The Digital Gadgets 04-241/242 The Mineral Boutique B1-205/206 The Tinsel Rack B1-256 TOYS R US/ Kiztopia B1-210 Traveller World B1-228 Tsui Wah 03-230 Ya Kun Kaya Toast 01-K206/207 Yu Cookies B2-245 VIVAIA B1-254/255 Watsons B2-217/218 Weston Corp 02-239 Zoomoov L4 YOTELAIR Singapore Changi Airport Jewel Attractions tickets Changi Experience Studio tickets Temporary vendors at promotional spaces, e.g. Jewel Atrium, Cloud9 Piazza and Pop-up Stores Banks/ ATMs/ Money Changers/ Financial Services SISTIC/ AXS/ SAM payments Cash Card/ Stored Value Cards Top-Up transactions Lounges, passenger meeting services counters, left luggage service counters, tour and travel services Online purchases Car rental services, airport shuttle and transportation counters Tobacco products - Other terms and conditions by Jewel Changi Airport Devt Pte Ltd, Jewel Double Rewards, CapitaStar and eCapitaVoucher apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 590
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/Jewel-rassicQuest.html",
    "title": "Jewel-rassic Quest",
    "content": "Jewel-rassic Quest [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. ×Close JEWEL-RASSIC QUEST JEWEL-RASSIC QUEST AN AUGMENTED REALITY EXPERIENCE WITH DINOSAURS Embark on a thrilling adventure by teleporting 89 million years back to the Cretaceous period. Armed with a TimeLens, cadet rangers meet larger-than-life dinosaurs augmented against the lush greenery of the Forest Valley and Canopy Park. Complete the mission and participate in activities and games while learning more about behemoth creatures! Recommended age: 6 years old & above FIRST TIMESLOT/ LAST TIMESLOT: 10.30AM/ 5.30PM LOCATION Level 1 Concierge Counter JEWEL-RASSIC QUEST Ticket price includes: Rental of one (1) TimeLens device and other related components* as may be necessary for the participation in the Jewel-rassic Quest Each TimeLens device can be shared between 1 adult and 1 child Same day re-entry access into Canopy Park Complimentary digital photos (max.50) sent via email * Disposable earpiece will be provided. Guest may use their own personal audio device that is compatible with 3.5mm jack as well Standard Rate: SGD 20 Singapore Residents*: SGD 18 CapitaStar Members & Changi Rewards Members Special Rate [Available at Jewel Concierge Counters (L1, 2, 5)]: SGD 16.20 Mastercard® Cardholders Special Rate Key in promo code MCJEWEL to access special rates for Mastercard® cardholders. While stocks last. Notes: Each Ticket Holder shall be required to pay a refundable deposit of SGD 50 before the collection of the TimeLens device. Please arrive at L1 concierge 10 – 15 minutes prior to selected timeslot. Each Ticket Holder shall have 90 minutes of gameplay, followed by a 15- minute grace period to return the Timelens to the Level 1 concierge. Please note that late charges apply (SGD 10 for every 10 minutes after allotted 90-minute period). Each Ticket purchase will entitle 1 child (aged 3 – 12 years) and 1 adult admission to Canopy Park. Additional admission tickets are to be purchased separately. Other terms & conditions apply. * Applicable for Singapore citizens, permanent residents, employment pass, work permit and dependent pass holders. Proof of residency may be required at the point of ticket purchase and upon admission. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES *Terms and Conditions apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 508
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/mirror-maze.html",
    "title": "Mirror Maze - Jewel Changi Airport",
    "content": "Mirror Maze - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. ×Close MIRROR MAZE LOSE YOURSELF IN A KALEIDOSCOPIC ESCAPADE The Mirror Maze boasts a unique cover of greenery branching overhead, creating the illusion of endless bowers before you. OPENING HOURS 10:00AM - 9:00PM Last admission is 30 mins prior to closing time LOCATION Canopy Park (L5) Practical information Recommended attire: Comfortable covered shoes Luggage and wheeled bags are not allowed for safety reasons. Please leave your bags at the Baggage Storage. Mirror Maze Mirror Maze ticket includes admission to Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk). Standard Rate Adult - SGD 18.90 Child - SGD 13.90 Singapore Residents* Adult - SGD 15.90 Child/**Student/Senior - SGD 10.90 CapitaStar Members & Changi Rewards Members Special Rate [Available at Jewel Concierge Counters (L1, 2, 5)] Adult - SGD 14.30 Child/**Student/Senior - SGD 9.80 Child: 3 - 12 years old | Senior: 60 years old and above All Child ticket holders must be accompanied by a paying Adult. * Applicable for Singapore citizens, permanent residents, employment pass, work permit and dependent pass holders. Proof of residency may be required at the point of ticket purchase and upon admission. **Current students of local Universities, Polytechnics, Junior Colleges, Institutes of Technical Education and Secondary School holding a valid student photo ID are eligible to purchase student ticket. Verification will be done at the point of entry. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 1 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# Standard Rate Adult - SGD 39  |  **Child - SGD 29 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult #Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 2 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# 6. Bouncing Net^# Standard Rate Adult - SGD 54  |  **Child - SGD 39 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 3 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 56  |  **Child - SGD 40 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 4 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# 7. Bouncing Net^# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 71  |  **Child - SGD 50 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES *Terms and Conditions apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 810
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/forest-valley.html",
    "title": "Forest Valley - Jewel Changi Airport",
    "content": "Forest Valley - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. ×Close FOREST VALLEY EXPLORE ETERNAL SPRING WITHIN JEWEL Step out of the airport right into a lush green sanctuary, a tranquil retreat in the core of the world's best transport hub. Immerse yourself in this garden wonderland and meet Singapore, the City in a Garden. OPENING HOURS Open daily: 24 hours LOCATION Forest Valley: Entry and exit points between Level 1 to Level 4 Practical Information Allow half an hour for each trail, at a comfortable pace with ample time for photo-taking. There are several exit points and seats along the way. Luggage and wheeled bags are not allowed, but can be left at our baggage storage. - Suitable for all ages - High heels not recommended MORE ABOUTFOREST VALLEY Forest Valley Explore idyllic landscapes bathed in natural sunlight, a spectacular waterfall at the core. You'll discover intriguing plants from all around the world, with more than 900 trees and palms, and about 60,000 shrubs in this verdant indoor garden. Walking Trails Take a gentle hike up through the Forest Valley to the Canopy Park on Jewel's topmost level. The eastern trail leads you past rocky falls, while mists enhance your trek through the western trail. Admire the wide vistas across the Forest Valley and find enchantment at every turn. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 373
  },
  {
    "url": "https://www.jewelchangiairport.com/en/playatjewel-corporate.html",
    "title": "PlayatJewel - Corporate",
    "content": "PlayatJewel - Corporate [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. Corporate Membership ×Close 4 / 9 Reward your employees through Jewel Changi Airport’s corporate membership. Enjoy year-round unlimited admission to Canopy Park, Mastercard® Canopy Bridge, Hedge Maze, Mirror Maze, Bouncing Net and Walking Net! If you have any questions, kindly refer to our FAQ section or contact us via email at sales@jewelchangiairport.com. DOWNLOAD APPLICATION FORM DOWNLOAD APPLICATION FORM Please email the endorsed application form to: sales@jewelchangiairport.com Email subject: Corporate Membership Application (Company Name) Corporate Membership Plan ×Close 4 / 9 Corporate Membership Plan The Corporate Annual Pass entitles your staff and three accompanying guests to enjoy unlimited admission to Canopy Park and one time entry per day to Mastercard® Canopy Bridge, Hedge Maze, Mirror Maze, Walking Net and Bouncing Net. ×Close 1 / 9 Annual Corporate Membership (Price per card) 1 Physical Card      - $4,780 2 Physical Cards    - $4,000 3 Physical Cards    - $3,500 4 Physical Cards    - $3,000 Add on: Corporate E-Letter Scheme Staff located in multiple locations? Physical cards too much of a hassle? The Corporate E-Letter scheme maximises your company’s investment in the membership by: Issuing an electronic version of the membership in the form of an authorisation letter Minimising the administrative hassle of managing physical cards Maximising the utilization of the membership during the peak season by allowing a faster turnaround time of the membership card among your staff This scheme is available upon sign up of your corporate membership, subject to an additional annual fee of $3,230 per membership card. For those who like to trial our membership, a six months Season Corporate Membership programme is available! 6 Months Season Corporate Membership (Price per card) 1 Physical Card - $2,680 Add on Corporate e-letter at $1,800 Corporate Pass Holders Year Long Perks Shop & Dine Rest & Relax Explore & Play Enjoy exclusive promotion(s) at selected outlets in Jewel Changi Airport. JEWEL Privileges Retail and F&B Discounts Gift by Changi Airport: 10% off with min. $5 spend Click here for more info Rest & Relax at Changi Lounge or enjoy exclusive discounts for your staycation! 10% off for Changi Lounge Access Up to 20% at participating hotels (Crowne Plaza Changi Airport, Dusit Thani Laguna Singapore & YOTELAir Singapore Changi Airport) Click here for more info ADDITIONAL TICKET DISCOUNT FOR FAMILY & FRIENDS 20% off Singapore Resident Individual attraction tickets, Jewel-rassic Quest and Bundle Deals* *Up to 10 tickets to be purchased onsite via Jewel L5 Concierge Click here for more info Terms and Conditions USE OF CORPORATE ANNUAL PASS Passholder may enjoy the privileges and benefits stated here. Passholder must be present on-site with his/her valid corporate staff ID to enjoy the privileges and benefits. Privileges and benefits are offered at the sole and absolute discretion of Jewel Changi Airport and they are non-transferable and non-assignable. Corporate Annual Pass admissions: Each corporate annual pass entitles your staff to enjoy unlimited admission to Canopy Park and one time entry per day to Mastercard® Canopy Bridge, Hedge Maze, Mirror Maze, Bouncing Net and Walking Net for up to one staff and three accompanying guests (adult/child/senior) per day. A valid physical membership card or corporate e-letter must be presented along with corporate staff ID to be granted admission to the attractions or in order to enjoy the Attractions Pass privileges. All children under 12 must be accompanied by an adult. Admission to the various Jewel Changi Airport attractions using the Corporate Annual Pass is subject to blackout dates; closure of attractions due to maintenance or force majeure events; and separate ticketed events. Please refer to the Jewel Changi Airport Attractions website for more information. The use of the Corporate Annual Pass for admission into Jewel Changi Airport’s attractions is subject to the applicable terms and conditions of the attractions. All Passholders and users of the Corporate Annual Pass agree to Jewel Changi Airport’s attractions terms and conditions. Please refer to the full terms & conditions of the Jewel Changi Airport’s attractions here. Click here for the full Terms & Conditions. Frequently Asked Questions (FAQ) General FAQ 1.      What is Jewel Corporate Membership? Jewel Corporate Membership is the official membership programme offered to corporate companies by Jewel Changi Airport. As a member, corporate companies and ",
    "word_count": 1611
  },
  {
    "url": "https://www.jewelchangiairport.com/en/ticketing.html",
    "title": "Attractions Admission Tickets",
    "content": "Attractions Admission Tickets [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. Welcome to Canopy Park Explore the Canopy Park, a playground for everyone! ×Close 4 / 9 Jewel-rassic Quest An augmented reality experience with dinosaurs! Canopy Park A playground for everyone BUNDLE DEALS Enjoy more attractions at bundle price! BOUNCING NET Feel like you're bouncing among trees HEDGE MAZE Leafy playscapes you can't resist MASTERCARD® CANOPY BRIDGE Take a walk through the air WALKING NET Balance your way through an adventure MIRROR MAZE Lose yourself in a kaleidoscopic escapade Foggy Bowls Kids will love the chance to play in this dreamy setting and let their imagination take flight. Changi Experience Studio Go on a journey of fun and discovery through the exciting virtual world of Changi Airport! Engage in the wonder of amazing projection experiences and enjoy interactive games and immersive shows. In this first-of-its-kind digital attraction, experience the magic of technology and learn about aviation and what makes the airport tick. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES FAMILY BUNDLE DEAL FAMILY BUNDLE DEAL BUY NOW ON CHANGI APP BUY NOW ON CHANGI APP Corporate Membership Programme Enjoy Unlimited Admission, Jewel Privileges, Discounts on Jewel’s Guided Tours and more! Click here for more information. Terms & Conditions apply. DOWNLOAD APPLICATION FORM DOWNLOAD APPLICATION FORM PlayAtJewel Membership Enjoy unlimited access to our play attractions, such as Canopy Park, Mastercard® Canopy Bridge,  Hedge Maze, Mirror Maze, Bouncing Net and Walking Net, as well as exclusive shopping and dining discounts all year round! Guests can choose from different types of membership such as families, individual adults, children and seniors for their prefered membership. FIND OUT MORE FIND OUT MORE *Terms and Conditions apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 431
  },
  {
    "url": "https://www.jewelchangiairport.com/en/promotion/ocbc-mastercard-promotion.html",
    "title": "OCBC Mastercard Promotion",
    "content": "OCBC Mastercard Promotion [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. OCBC Mastercard Promotion 2025 Promotion Period 23 June 2025 to 31 July 2025 ×Close 4 / 9 Receive a S$10 Jewel Gift voucher when you charge a minimum of S$150 (max. 3 same-day receipts) to your OCBC Mastercard at any participating outlet! TERMS & CONDITIONS Promotion is valid for receipts from all Retail and Food & Beverage (F&B) outlets within Jewel Changi Airport, except for the following: Apple store K-Cuts Hotels, i.e YOTELAIR Singapore Changi Airport Servicing charges from Dyson Demo Store Service Centre Health screening and screening packages from Minmed Wellness Collective Packages from Natureland Spa. Premium Gift by Changi Airport Online purchases, including website purchases for Jewel Attractions and Changi Experience Studio Receipts for purchase of donation bundles from Fairprice Finest All voucher purchases, e.g. Jewel vouchers, tenant vouchers, eCapitaVoucher Banks / ATMs / Money Changers / Financial Services SISTIC / AXS / SAM payments Cash Card / Stored Value Cards Top-Up transactions/ iTunes Gift Card Temporary vendors at promotional spaces, e.g. Jewel Atrium, Cloud9 Piazza and pop-up stores, pushcarts/kiosks and vending machines Lounges, passenger meeting services counters, left luggage service counters, tour and travel services Other terms and conditions by Jewel Changi Airport and Mastercard apply. TERMS & CONDITIONS TERMS & CONDITIONS STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 365
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/ces.html",
    "title": "Changi Experience Studio - Jewel Changi Airport",
    "content": "Changi Experience Studio - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. VIEW PHOTOS ×Close CHANGI EXPERIENCE STUDIO A JOURNEY OF FUN AND DISCOVERY Go on a journey of fun and discovery through the exciting virtual world of Changi Airport! Engage in the wonder of amazing projection experiences and enjoy interactive games and immersive shows. In this first-of-its-kind digital attraction, experience the magic of technology and learn about aviation and what makes the airport tick. For general enquiries on ticketing or admission, please email to ces.enquiry@changiairport.com. For event booking enquiries, please email to ces.sales@changiairport.com. For learning journeys and visits by schools or corporate groups, please email learn@changiairport.com. OPENING HOURS Mon - Fri : 11:00AM - 8:00PM （Last admission at 7.00PM) Sat, Sun & PH: 10:00AM - 8:00PM （Last admission at 7.00PM) LOCATION L4 MORE ABOUTCHANGI EXPERIENCE STUDIO A JOURNEY OF FUN AND DISCOVERY Explore and enjoy 20 different interactive touchpoints over 10 content zones. Learn about the history and development of Changi, go behind the scenes of its operations and play games simulating airport functions. A fascinating journey of discovery and play for both adults and children alike. Find out more JOIN US FOR A LEARNING ADVENTURE Changi Experience Studio tells the stories of Changi Airport and gives a glimpse into what lies behind the success of Singapore’s air hub. Besides being a showcase of digital innovation in edutainment and experience creation, the studio also offers a specially curated range of programmes for both adults and students to gain a deeper understanding of how Changi Airport is managed and its innovation journey. Find out more about its programmes. Find out more CELEBRATE SINGAPORE'S BIRTHDAY WITH A GREAT BUNDLE DEAL Celebrate Singapore’s 60th birthday with our Great Bundle Deal of 6 tickets for only S$60 at Changi Experience Studio. Senior citizens aged 60 years old and above can also purchase tickets at $6 each. Available from 14 March 2025, all local residents can enjoy this promotion when they purchase the tickets at the attraction’s ticketing counter. Explore, play and discover all about the nation’s icon – Changi Airport, as you play airport-themed games. Hurry, call up your family and friends to enjoy a fun day out at Changi Experience Studio - the more the merrier! Singapore Residents* Tickets Adult - SGD 19.80  |  Child/Senior - SGD 14.80 Terms and Conditions: Sale and visit period is from 14 March to 30 September 2025. Sale of discounted bundle tickets is only available for counter purchase at Changi Experience Studio (Level 4), and not available online. Discount bundle is only applicable for Singapore residents only. Promotion is only available in a bundle of 6 Singapore Residents tickets. Tickets bought under this promotion allow for single entry to Changi Experience Studio. No refund or exchange on unused tickets. [Advisory] Changi Experience Studio will be closed for a private event on 1 August, 5pm to 8pm (last entry at 4pm). TAKE FLIGHT AT CHANGI AIRPORT BUNDLE Buckle up and enjoy double the fun with two exciting adrenaline-filled aviation adventures rolled into one amazing bundle deal! Featuring two exciting attractions: a 15-minute flight simulator flying experience brought into Changi Experience Studio from a real flight school - Aeroviation, plus entry to the fun airport-themed digital attraction, ‘Take Flight at Changi Airport’ Aviation Experience allows you to experience the thrill of piloting an aircraft over Singapore’s skyline in a flight simulator and learn all about Changi Airport through fun and games! ‘Take Flight at Changi Airport’ Aviation Experience Bundle Promo Rate Adult - SGD 51.80 (U.P. SGD64)  |  Child/Senior/ Student^ - SGD 49.80 (U.P. SGD56) Important Notes: ‘Take Flight at Changi Airport’ Aviation Experience Bundle includes a single entry to Changi Experience Studio and a 15-minute Flight Simulator experience. Participants of Aeroviation Flight Simulator must be at least 7 years old with a minimum height of 110cm Participants are to book their Flight Simulator experience to ensure availability of slots before the visit to Changi Experience Studio as both experiences must be on the same day Please note that the Flight Simulator can only accommodate one (1) person at a time. If there is more than 1 person participating in the Flight Simulator, you will have to book the next available time slot (subject to availability). Purchase of Aviation Experience Bundle is valid for two (2) months from date of purchas",
    "word_count": 1845
  },
  {
    "url": "https://www.jewelchangiairport.com/en/promotion/Jewel-Privileges.html",
    "title": "Jewel Privileges - Jewel Changi Airport",
    "content": "Jewel Privileges - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. Jewel Privileges Promotion Period 1 April 2025 - 31 March 2026 LOCATION Participating Outlets ×Close 4 / 9 Jewel Privileges Programme Enjoy exclusive promotions by presenting your Jewel Privilege e-card (^ via Changi App here) or physical card at participating outlets. You may collect your physical card today at Level 1 Concierge Counter! TOURIST PERKS Flash your foreign passport to receive the following perks: - Jewel Privilege Card - $5 Retail Voucher* (Mastercard® Cardholders get to redeem for an additional $5 Retail Voucher* when you flash your card!) - $5 Attractions Voucher - Free Jewel Premium when you spend a min. of $100 in a max. of 3 same-day receipts (While stocks last!) *Find out more about Jewel Retail Voucher here. ^Download the Changi app here and log in to view your e-card. Click here for the full listing of privileges and deals. Tourist Exclusive: Your Tax Refund Starts at Jewel Enjoy more savings when you shop at Jewel Changi Airport! Find out more here. Terms and Conditions •Jewel Privilege Card/EDM has to be presented at participating outlets to enjoy the special discounts and promotions. •All promotions are valid at participating outlets in Jewel Changi Airport only. •Promotions are subject to availability and respective outlet's terms and conditions. •Please visit the respective outlet for the full terms and conditions. •Tourist Perks: •Tourists are required to present their passport as well as their Mastercard® at Level 1 Jewel Concierge for verification to redeem for the $5 Retail Voucher. •$5 Retail Voucher and $5 Attractions Voucher redemption is for tourists. Our Concierge may request to see the traveller’s boarding pass stub to facilitate the redemption. •Limited to one redemption per tourist per day, while stocks last. •To qualify for Jewel free premium promotion, shoppers must spend a minimum of $100 across a maximum of 3 same-day receipts at any Jewel Privileges participating stores in Jewel Changi Airport. •All redemptions must be made at Level 1 Jewel Concierge, from 10am to 10pm, daily. •Vouchers and jewel premiums are not refundable and exchangeable for cash, and cannot be replaced, if lost, damaged or expired. •Jewel Changi Airport reserves the right to amend the terms and conditions of the promotion. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 528
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions.html",
    "title": "Attractions & Gardens | Things to Do - Jewel Changi Airport",
    "content": "Attractions & Gardens | Things to Do - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. ATTRACTIONS JEWEL ATTRACTIONS Jewel-rassic Quest <p>An augmented reality experience with dinosaurs</p> Walking Net Balance your way through an adventure Bouncing Net Feel like you're bouncing among trees Mirror Maze Lose yourself in a kaleidoscopic escapade Hedge Maze Leafy playscapes you can't resist Mastercard® Canopy Bridge Take a walk through the air Discovery Slides A sculptural playscape Changi Experience Studio <p>A journey of fun and discovery through the exciting virtual world of Changi Airport</p> Jewel Rain Vortex The marvel at Jewel's heart Canopy Park A recreational playground for everyone Forest Valley Explore eternal spring within Jewel Foggy Bowls Play amongst the clouds Petal Garden The winsome charm of a garden in bloom Topiary Walk A whimsical wonderland Canopy Park Bundle Deals <p>Bundles of fun at Canopy Park</p> LOAD MORE STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 296
  },
  {
    "url": "https://www.jewelchangiairport.com/en/promotion/changi-millionaire-202311.html",
    "title": "Changi Millionaire Experiences",
    "content": "Changi Millionaire Experiences [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. Changi Millionaire Experiences Promotion Period 15 January 2025 - 31 December 2025 LOCATION Changi Airport, Jewel Changi Airport and online at iShopChangi.com ×Close 4 / 9 Simply spend S$50 and above at Changi Airport, Jewel Changi Airport or on iShopChangi.com to: Get a chance to win a bespoke luxury travel experience per quarter Drive home a Porsche Taycan Bring home Changi Editions premiums from S$6.90 onwards Receive an instant shopping voucher Double your chances when you shop with Changi Pay or on iShopChangi! Terms and Conditions Apply. Win Now Win Now STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 251
  },
  {
    "url": "https://www.jewelchangiairport.com/en/playatjewel.html",
    "title": "PlayatJewel",
    "content": "PlayatJewel [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. PlayAtJewel Membership ×Close 4 / 9 JOIN US AS A MEMBER TODAY! The PlayAtJewel Membership Programme aims to engage and reward members with great savings and an extensive host of privileges – including unlimited admission to Canopy Park, Mastercard® Canopy Bridge, Hedge Maze, Mirror Maze, Bouncing Net and Walking Net and exclusive shopping and dining discounts all year round! We look forward to welcoming you to our ever-growing family. If you have any questions, kindly refer to our FAQ section or contact us via email at contact.us@jewelchangiairport.com. Click here to purchase individual membership Click here to purchase individual membership Click here to purchase family membership Click here to purchase family membership Click here to log-in to existing membership Click here to log-in to existing membership Membership Plans ×Close 4 / 9 Membership Plans There are different types of membership plans to suit your needs. Select one of the following and join us as a PlayAtJewel Member today! ×Close 1 / 9 For families with 2 adults and 1 child /senior citizen PlayAtJewel Family Pass : $188 for 1-year membership per family Additional child / senior citizen at $30 (Up to max 4) PlayAtJewel + Changi Experience Studio Family Pass: $270 for 1-year membership per family Additional child / senior citizen at $42 (Up to max 4) ×Close 1 / 9 Adult (Aged 13 -59 years old) PlayAtJewel Annual Pass : $105 for 1-year membership per person Season Pass: $65 for 6 months membership per person PlayAtJewel + Changi Experience Studio Annual Pass: $140 for 1-year membership per person Season Pass: $90 for 6 months membership per person ×Close 1 / 9 Children (Aged 3 - 12 years old) PlayAtJewel Annual Pass : $75 for 1-year membership per person Season Pass : $45 for 6 months membership per person PlayAtJewel + Changi Experience Studio Annual Pass: $98 for 1-year membership per person Season Pass: $60 for 6 months membership per person *Children must be accompanied by adults *Children must be of a minimum height of 110cm to enter Discovery Slides, Walking Net and Bouncing Net. ×Close 1 / 9 Senior Citizen (Aged 60 years old and above) PlayatJewel Annual Pass : $75 for 1-year membership per person Season Pass : $45 for 6 months membership per person PlayatJewel + Changi Experience Studio Annual Pass: $98 for 1-year membership per person Season Pass: $60 for 6 months membership per person PLAYATJEWEL - CORPORATE ANNUAL PASS Reward your employees through Jewel Changi Airport’s corporate membership. Enjoy year-round unlimited admission to Canopy Park, Mastercard® Canopy Bridge, Hedge Maze, Mirror Maze, Bouncing Net and Walking Net! Find out more here! If you have any questions, kindly refer to our FAQ section or contact us via email at sales@jewelchangiairport.com. Annual / Season Pass Holders Year Long Perks Shop & Dine Rest & Relax Explore & Play Birthday Perks Enjoy exclusive promotion(s) at selected outlets in Jewel Changi Airport. JEWEL Privileges Retail and F&B Discounts Gift by Changi Airport: 10% off with min. $5 spend Click here for more info Valid for Individual/Family Annual Pass & Individual Season Pass Rest & Relax at Changi Lounge or enjoy exclusive discounts for your staycation! 10% off for Changi Lounge Access Up to 15% at participating hotels (Crowne Plaza Changi Airport & YOTELAIR Singapore Changi Airport) Click here for more info Valid for Individual/Family Annual Pass & Individual Season Pass ADDITIONAL TICKET DISCOUNT FOR FAMILY & FRIENDS 20% off Singapore Resident Individual attraction tickets, Jewel-rassic Quest and Bundle Deals* Invitations to exclusive events/ launches *Up to 10 tickets to be purchased onsite via Jewel L5 Concierge. Terms & Conditions apply. Valid for Individual/Family Annual Pass & Individual Season Pass. Enjoy a list of Birthday Perks Discount at Canopy Park attractions and selected participating stores. Sweet Treat Privileges Free Birthday Goodie Bag Valid for Individual/Family Annual Pass only Terms and Conditions USE OF ATTRACTIONS PASSES Depending on the type of Attractions Pass membership, Passholder may enjoy the privileges and benefits stated here . Privileges and benefits are offered at the sole and absolute discretion of JCAT and they are non-transferable and non-assignable. Attractions Pass admissions: Individual Adult Passes and Individual Child/Senior Passes are non-transferable and admits the Passholder only. Family Annual Pass is limited to a maximum of 2 Adults and 5 Child/Senior. Guest to login and present a valid e-card for admission into attractions ",
    "word_count": 2056
  },
  {
    "url": "https://www.jewelchangiairport.com/en/Jewel-BeLeafers-Programme.html",
    "title": "Jewel BeLeafers",
    "content": "Jewel BeLeafers [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September. Jewel BeLeafers Programme Participation Period Monthly LOCATION Canopy Park / Forest Valley ×Close 4 / 9 HANDS-ON GARDENING Ever wondered how the trees and plants at Jewel are maintained? We are now offering an opportunity for interested parties to have a hands-on experience of tending to the plants at Singapore’s iconic destination, Jewel! You will get to learn more about the behind-the-scenes at the best airport in the world! Do you enjoy gardening? The BeLeafers programme offers you a hands-on experience with gardening not just at Jewel, but also at other locations in the airport community. This can double up as a great bonding activity for friends and families. Everyone is welcomed, from gardening novice to experts, you can now be a part of the team involved in the gardening sessions at Jewel and the airport. Learn basic pruning and weeding techniques, or even have a chat with our horticulture expert about all plant-related questions when you participate in the BeLeafers volunteer programme. These sessions will take you through the lush and tranquil landscapes of the Forest Valley, Canopy Park, Jewel’s external gardens and even Changi Airport nursery. Do dress comfortably as you will need to bend or squat as you tend to our plants! Sign up for the BeLeafers volunteer programme here today! *The programme is open to able-bodied participants ages 13 years old and above, and volunteers who are able to handle gardening/sharp tools. **The programme is catered for individuals. If you would like to find out more about team building programmes available at Jewel, please click here! STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 419
  }
]