[
  {
    "url": "https://www.changiairport.com/en/fly/security-and-baggage-restrictions.html",
    "title": "Security And Baggage Restrictions",
    "content": "Security And Baggage Restrictions Security Screening and Baggage Restrictions Important information and tips for clearing security. Baggage Restrictions Liquids, Aerosols, Gels BAGGAGE RESTRICTIONS As part of international safety measures to protect you and your loved ones when travelling, some items may be prohibited on the aircraft. It is an offence if you fail to comply with these measures, as the safety of all passengers on the flight could be compromised. Generally, you must not take on board items listed below. Do note that these lists are not exhaustive. Firearms of any kind, including replicas and toys. More Pointed/edged weapons or sharp objects (e.g., multi-purpose tool kits of all sizes). More Blunt objects (e.g., bats, skateboards and paddles). More Chemical and toxic substances, as well as dangerous goods. More Corrosive substances (e.g., batteries, mercury or drain cleaners) Hand-carried luggage guidelines Hydrocarbon gas-powered hair curlers are limited to one per person. The safety cover must be securely fitted at all times over the heating element. Separate gas refills for such curlers are not permitted. Safety matches or lighters are permitted only when carried on the person. The lighter can contain only absorbed liquid or liquefied gas fuel. Refills are not permitted. Battery-powered wheelchairs are permissible as checked luggage only. However, do contact your airline in advance to check whether special conditions apply. Restrictions apply to Liquids, Aerosols and Gels (LAGs) in hand-carried luggage. Specific to passengers travelling to EU airports (including Switzerland), only LAGs in sealed Security Tamper Evident Bags (STEB) bearing the SGP state code, purchased within the transit areas of Singapore Changi Airport will be allowed onboard due to security restrictions imposed by EU. If in doubt, please check with your airline before your flight. Powder-like substances kept in a single container and which are heavier than 350g (or 350ml) are prohibited by Transportation Security Administration (TSA) in hand-carried bags on all U.S.-based airlines as well as on non-stop flights to the U.S.A. If you need to carry larger amounts of powdered substances, they must be in checked baggage. Exceptions to this include: Duty-free purchases packed in Security Tamper Evident Bags (STEB). Restrictions may apply. Please check with your respective airline. Human remains. Baby formula, if you are travelling with an infant. Medication, accompanied by a doctor's letter. All powder-like substances in carry-on bags may be subjected to further screening. Please check with your airline for advice before your flight. LIQUIDS, AEROSOLS AND GELS Singapore implemented guidelines that restrict the amount of liquids, aerosols and gels (LAGs) that passengers can carry in their hand-carried luggage. LAGs that do not meet the guidelines must be checked-in. Guidelines on LAGs These apply to all flights departing from Singapore. LAGs in containers exceeding 100ml will not be accepted, even if partially filled. Grams and millilitres can be used interchangeably. Place the containers (not exceeding 1 litre in total) in a transparent, re-sealable plastic bag which must be completely closed. Only one transparent, re-sealable plastic bag per passenger is allowed. The bag must be presented separately for examination at the security screening point. All LAGs that do not meet the above requirements must be disposed of before the security screening point. Exemptions can be made for baby food & breast milk, provided your infant is travelling with you. Other items may also be exempted upon presentation of a bona fide doctor’s letter. Additional checks may be conducted for the safety of all passengers. LAGs purchased at Changi which are in containers larger than 100ml should be kept sealed in their sealed tamper-evident bags provided by the shops, with the receipt clearly displayed in the sealed bags. Examples of LAGs Drinks (e.g., water or juices) Soups and sauces Perfumes and deodorants (liquid or liquid-solid mixture) Creams, balms, lotions and oils Cosmetics (e.g., mascara or lip gloss) Pastes (e.g., toothpaste) Pressurised foams and sprays (e.g., shaving foam, hairspray or spray deodorants) Gels (e.g., hair or shower gels) Contact lens solution Canned food with liquid content Any other items of similar consistency Purchasing LAGs at Changi Shopping within Public Area If you have purchased LAGs from shops within Changi Airport's Public Areas, please place the items into your check-in luggage prior to checking-in for your flight. If the items do not exceed a maximum capacity of 100ml per container, you may hand-carry them in the 1-litre transparent and re-sealable plastic bag, which must be completely closed. Shopping within Departure Transit Area You can continue to purchase LAGs, such as liquor, wine, beer, perfumes and cosmetics, at shops located within Changi Airport's Departure Transit Area. Please ensure that LAGs purchased a",
    "word_count": 1163
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-2.html",
    "title": "Terminal 2",
    "content": "Terminal 2 Terminal 2 Welcome to the all-new Terminal 2 (T2), where nature meets modernity. About Terminal 2 T2 seamlessly merges the realms of architecture and landscape. The terminal’s carpet mirrors natural topography to guide your path, while clouds dance on the ceilings above. By incorporating natural materials and hues, the terminal aims to engender serenity for passengers and visitors alike. Attractions Explore unique attractions and hidden gems at T2 Find out more Facilities Enhance your journey with top-notch facilities in T2 Find out more Services Lift your experience with superb services in T2 Find out more Retail Find diverse retail experiences here in T2 Find out more Dining Find diverse dining experiences here in T2 Find out more Happenings Catch the latest buzz and what's happening at T2 Find out more website images Visit Hub & Spoke at T2 Find out more AIRPORT SERVICES AT T2 FLIGHTS Hotel TRANSPORT WIFI MAP SPECIAL ASSISTANCE Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 361
  },
  {
    "url": "https://www.changiairport.com/en/fly/arrival-guide/baggage-services.html",
    "title": "Baggage Services",
    "content": "Baggage Services BAGGAGE SERVICES Baggage Storage Visit our Baggage Storage counters if you need your baggage looked after while you shop hands-free or leave the airport comfortably. Find out more here Porter Services Porter services are available at all terminals to assist you with your baggage upon arrival or departure at Changi Airport. Find out more here Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 264
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/special-assistance.html?linkedListSection=invisible-disability",
    "title": "Special Assistance",
    "content": "Special Assistance SPECIAL ASSISTANCE As an inclusive airport, we provide a range of accessible facilities and services to make your travel experience extra comfortable. TRAVELLING WITH CHILDREN ASSISTANCE FOR PERSONS WITH REDUCED MOBILITY ASSISTANCE FOR PERSONS WITH INVISIBLE DISABILITY OTHER ASSISTANCE TRAVELLING WITH CHILDREN Baby Milk If your baby is travelling with you, you may bring expressed breast milk onboard the aircraft. If not, you need to store the milk in containers not exceeding 100ml. More × <h3>Baby Milk</h3> <p><strong>Q: My baby is not travelling with me. Am I allowed to bring my breast milk onboard?</strong></p> <p>If your baby is not travelling with you, we would strongly advise you to store the expressed breast milk into containers not exceeding 100ml. The containers must fit comfortably in a 1-litre resealable plastic bag. The personal LAGS items will be discarded if it is not within the permissible capacity. Nonetheless, these personal LAGS items will be subjected to additional checks at the Pre-Board Security Screening Area, prior to boarding the aircraft.</p> Strollers You may obtain one directly at any of our Information Counters across all terminals and Jewel. More × <h3>Strollers</h3> <p>Changi Airport offers complimentary use of baby strollers, on a first-come-first-served basis. You may approach the information counters to obtain one, or click <a href=\"https://changiairportbooking.com/v2/#book\"><strong>h<u></u>ere</strong></a> to book (this link leads to an external booking platform). Strollers are also available for loan at the concierge counters in Jewel. Do note that a nominal refundable deposit is required and the strollers have to be returned at 9:30 PM.</p> Family Facilities From playgrounds to baby care rooms, we have all you need to entertain and take care of your kids. Find out what we offer at each terminal. More Unaccompanied Minor Service If your child is below the age of 12 and travelling alone, you can contact your airline for unaccompanied minor service. Refer to our Airlines page for contact details. More ASSISTANCE FOR PERSONS WITH REDUCED MOBILITY Using personal mobility equipment More × <p><strong>Using personal mobility equipment</strong></p> <p>If you are planning to travel with your own personal mobility equipment, do contact your airline in advance to make the necessary arrangements. Your airline will also advise on personal mobility equipment accepted on different aircrafts, things to note when checking-in your personal mobility device, as well as time for you to be present for check-in if you are using your personal mobility equipment to the boarding gate. Find your airlines’ contact&nbsp;<a href=\"https://www.changiairport.com/en/fly/airline-information/passenger.html\"><strong>here</strong></a>.</p> <p><br _rte_temp_br=\"brEOB\"> <br> </p> Wheelchair options available More × <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"682\"> <tbody><tr><td width=\"386\" valign=\"top\"><p>At Changi, there are a range of options available to meet the specific travel needs of all passengers with reduced mobility. Choose the option that best meets your needs.</p> <p>&nbsp;</p> <p><strong>Complimentary self-assist wheelchair by Changi Airport</strong></p> <p>Changi Airport offers complimentary self-assist wheelchairs across our 4 terminals, for use by our passengers and airport visitors. These wheelchairs may be loaned from information counters at each terminal’s departure hall, transit area, and arrival hall. These wheelchairs are available for airport-use only, on a first-come-first-served basis. If you require a wheelchair before they are replenished at the information counters, please contact the staff or virtual agent at the counter to arrange a wheelchair for you. You may also click <a href=\"https://changiairportbooking.com/v2/#book\"><strong>here</strong></a> to book a complimentary wheelchair ahead of your arrival at Changi Airport.</p> <p>Complimentary wheelchairs are also available for loan at Jewel Changi Airport. You may find them at Jewel’s concierge counters.</p> <p>&nbsp;</p> <p><strong>Wheelchair service by your airline</strong></p> <p>All airlines offer wheelchair service to their passengers. To ensure your request is met by your airline, you are encouraged to book the wheelchair service from your airline and/or travel agent when you book your flight, up to at least <strong>48 hours</strong> before flight departure. Please contact your airline for assistance for requests made less than 48 hours before your flight departs.</p> <p>Airlines may facilitate passengers with differing degrees of reduced mobility according to their needs. Your airline’s Special Assistance staff may ask if you are able to walk short distances. Please note that this helps to identify the level of assistance you require, so that you can be served better. During periods of high service demand, some waiting time may also be expected for the airline’s wheelchair service.</p> <p>Addi",
    "word_count": 2535
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information/freighter/arrivals.html",
    "title": "Arrivals",
    "content": "Arrivals Freighter Arrivals Keep track of arriving freighter flights with live updates. Arrivals Departures Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 221
  },
  {
    "url": "https://www.changiairport.com/en/fly/getting-started-in-singapore.html",
    "title": "Getting Started In Singapore",
    "content": "Getting Started In Singapore GETTING STARTED IN SINGAPORE Find out how to get to the city, stay connected, and more. Accommodation Transport Local Attractions Get Connected ACCOMMODATION Book a Hotel Stay Yet to arrange your accommodation in Singapore? Visit our Changi Recommends booths located at any Arrival Hall or book a hotel here. Alternatively, check out Crowne Plaza Changi Airport if you want to stay near the airport. GETTING OUT OF THE AIRPORT Heading to the city? Our efficient transport network makes it easy. Leaving the Airport Explore transportation options including public buses, trains, taxis, private hire vehicles, and airport shuttles. More City Shuttle At a rate of S$10 per adult, the City Shuttle takes you to most of the hotels in town. More LOCAL ATTRACTIONS See the Sights Experience Singapore's best attractions with Changi Recommends, your all-in-one travel concierge. Simply visit Changi Recommends booths at any Arrival Hall. Find out more here GET CONNECTED Keep connected with your loved ones on the go, through a local SIM card or WiFi router. Local SIM Card Stay connected with pre-paid SIM cards. Pick one up at the Changi Recommends booth or money changers in any terminal. Find out more WiFi Router Rent a ChangiWiFi router to enjoy Internet access. Simply make a reservation here and pick up your router when you arrive. Find out more OTHER LINKS Immigration & Customs Security Lounge & Baggage Services Related links Departing Transit Special Assistance Facilities and Services Transport Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 451
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information/arrivals.html",
    "title": "Arrivals",
    "content": "Arrivals ARRIVAL FLIGHT LISTING Keep track of arriving passenger flights with live updates. Arrivals Departures Disclaimer Every effort has been made to ensure the information provided is correct. The dates, times and other details shown in the tables may, from time to time, be changed without notification. CAG and/or its agents, employees or contractors are not responsible for any incorrect information and are, therefore, not liable in any way for inaccuracies or errors. Users are advised to consult with airlines directly before travelling. Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 290
  },
  {
    "url": "https://www.changiairport.com/en/fly/departure-guide/fast-check-in.html",
    "title": "Fast Check In",
    "content": "Fast Check In FAST CHECK-IN Enjoy shorter queues and greater flexibility.​ FAST AND SEAMLESS TRAVEL (FAST) FAST is a suite of self-service options for departing passengers. These options are available to passengers travelling with participating airlines and eligibility criteria apply.​ 1. First, collect your boarding pass and print your bag tag(s) at the Automated Check-in Kiosks. You may then proceed to immigration if you do not require document checks and have no check-in bags. This option is available to passengers travelling with participating airlines. 2. Next, tag and drop your check-in bag(s) at the Automated Bag-Drop Machine. This option is only available to passengers travelling with participating airlines. 3. At the Automated Immigration Gates, scan your passport, boarding pass, and iris/fingerprint to authenticate your identity. 4. Once you reach the Automated Boarding Gates, scan your boarding pass and have your photo taken. You are now ready to board your flight! OTHER LINKS Pre-Flight Check Immigration & Customs Security Related Links Arriving Transit Special Assistance Facilities And Services Transport Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 375
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/transport-and-directions/leaving-the-airport.html",
    "title": "Leaving The Airport",
    "content": "Leaving The Airport LEAVING CHANGI AIRPORT How to get to the city and other parts of Singapore from Changi Airport. bus train Taxi and Private Hire Car Car Airport Transfer PUBLIC BUS Terminals 1, 2 and 3: Bus stops are located at the basement bus bays. You can take buses 24, 27, 34, 36, 53, 110 and 858 from there. Terminal 4: At the bus stop next to Car Park 4B, you can take buses 24, 34, 36 and 110. At the bus stop near the SATS Inflight Catering Centre 1, you can take buses 27, 53 and 858. Payment options for public transport include contactless Mastercard/Visa/NETS bank cards, mobile wallets, Stored-value EZ-Link cards can be purchased from any Changi Recommends store, and at the Passenger Service Centre or TransitLink Ticket Office at Changi MRT Airport Station. Stored-value EZ-Link cards can be purchased from any Changi Recommends store, at the Passenger Service Centre or TransitLink Ticket Office at Changi MRT Airport Station. Click here for more information on the payment options for public transport. Alternatively, you may use cash to pay for your bus fare. Please prepare the exact fare for your trip as no change will be given. TRAIN To get to the city, take the train from Changi Airport MRT Station (CG2) to Tanah Merah MRT Station (EW4), then transfer to the East West Line towards Tuas Link MRT Station (EW33). Alternatively, take the train from Changi Airport MRT Station to Expo MRT Station (CG1/DT35), then transfer to the Downtown Line towards Bukit Panjang MRT Station (BP6/DT1). To get to Pasir Ris, take the train from Changi Airport MRT Station to Tanah Merah MRT Station, then take the East West Line towards Pasir Ris MRT Station (EW1). Get detailed train timings on the SMRT Journey Planner. Train Route First Train Last Train From Changi Airport MRT Station to Tanah Merah MRT Station: Monday to Saturday: 5:31 AM Sunday and public holidays: 5:59 AM Connecting to Tuas Link: 11:18 PM, daily Connecting to Pasir Ris: 12:06 AM, daily Payment options for public transport include contactless Mastercard/Visa/NETS bank cards, mobile wallets, stored-value EZ-Link/NETS FlashPay cards, and Singapore Tourist Pass. Do note that admin fees apply for payments with foreign-issued bank cards. Stored-value EZ-Link cards can be purchased from any Changi Recommends store, and at the Passenger Service Centre or TransitLink Ticket Office at Changi Airport Station. Click here for more information on the payment options for public transport. TAXI Taxis are available for hire at the taxi stands in the Arrival areas of Terminals 1, 2, 3 and 4. A ride to the city takes about 30 minutes and costs between S$25 and S$45. All fares are metered. There is an additional Airport Surcharge for all trips originating from the Airport: Mon–Sun (5:00PM – 11:59PM): S$8 All other times: S$6 Separately, midnight and peak-hour surcharges apply to taxi hires country-wide. Midnight surcharge (50% of final metered fare): Mon-Sun (12:00AM – 5:59AM) Peak-hour surcharge (25% of final metered fare): Mon-Fri, excluding Public Holidays (6:00AM–9:29AM) Sat, Sun and Public Holidays (10:00AM-1:59PM) Mon-Sun (5:00PM-11:59PM) *Note: Flag-down charge plus distance and waiting charges differ among taxi companies. PRIVATE HIRE CAR Passengers can also book private hire cars from Grab, Gojek, Zig, Tada Mobility or Ryde for a ride out of the airport. Make a booking via the respective transport providers’ mobile applications (downloadable on Apple App Store and Google Play Store) and head to the Arrival and Ride-Hailing pick-up points at Terminals 1, 2, 3 or 4. Note: Only Singapore taxis and Malaysian taxis with an ASEAN Public Service Vehicle Permit (ASEAN PSVP) are licensed to provide cross-border taxi or Private Hire Car (PHC) services to ferry passengers between Singapore and Malaysia. These taxis can be hired at Ban San Street Terminal (Singapore) and Johor Larkin Terminal (Malaysia), which are the designated pick-up and drop-off points for cross-border taxi services. Passengers may also book cross-border trips through licensed Singapore taxi operators. CAR For passengers who need to be picked up by car, please head to our Arrival pick-up points​. You can also rent a car here or at any car rental counter at the Arrival Halls. AIRPORT TRANSFER Our 24-hour Ground Transport Concierges (GTC) offers convenient transfers from Changi Airport to your destination. There are two ways to make a booking: 1. Click here or download the Changi App to book a ride in advanced 2. Approach our friendly customer service officers at the GTC counters at the following locations: T1: Arrival Pick-up, Basement T2: Arrival hall, level 1, door 5 T3: Arrival hall, level 1 (next to information counter) T4: Arrival hall, level 1 (next to information counter) Transportation options include: 4-seater vehicle (S$55.00 per trip to any destination in Singapore) 6-seater vehicle (S$60.00 per trip to any destination in Singapore) Helpful links Getting to the Airport Transfer between Terminal",
    "word_count": 1032
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/facilities-and-services-directory/pay-per-use-lounges.html",
    "title": "Pay-Per-Use Lounges",
    "content": "Pay-Per-Use Lounges Pay-Per-Use Lounges Enjoy an elite travel experience at your leisure. Lounges Location About All T1 T2 T3 T4 Jewel PUBLIC TRANSIT Jewel Level1 Changi Lounge +65 6513 8743 06:00 - 22:00 Daily (Last order at 9:00 pm)<br> View On Map T2 Public Level1 Hub & Spoke 07:30 - 22:00 Daily View On Map T1 Transit Level3 (above Gate C1), Plaza Premium Lounge Open 24 hours Daily View On Map T2 Transit Level3 Ambassador Transit Lounge Open 24 hours Daily View On Map T2 Transit Level2 JetQuay 06:15 - 19:00 Daily View On Map T3 Transit Level3 (next to the Movie Theatre), Ambassador Transit Lounge Open 24 hours Daily View On Map T4 Transit Level2M (near 7-Eleven), Blossom - Sats & Plaza Premium Lounge +65 6581 3073 Open 24 hours Daily View On Map Terminal 1 Plaza Premium Lounge Location: Terminal 1, Level 3, Departure Transit Hall (above Gate C1) Operating Hours: 24 hours, daily Tel: +65 6443 2730 Email: singapore@plaza-network.com Website: www.plazapremiumlounge.com Map Enjoy award-winning facilities and services, while savouring delectable signature dishes such as Singapore Laksa and Chicken Rice. You can also relax in private resting suites and enjoy refreshing showers with full amenities. Food and beverage is available 24/7. **Prices are in Singapore Dollars and subject to prevailing local taxes and service charges SERVICE TYPE NO. OF HOURS RATE Lounge Use Adult 3 hours S$55 5 hours S$97 10 hours S$195 Child (above 2 years old) 5 hours S$55 Child (below 2 years old) Complimentary Private Resting Suite Single Suite 6 hours S$155.51 Extension per hour S$21 Family Suite 6 hours S$225.54 Extension per hour S$21 Terminal 2 Ambassador Transit Lounge Location: Terminal 2, Level 3, Departure Transit Hall Operating Hours: 24 hours, daily Tel: +6562410978 Map Email: atl@harilelahospitality.com Website: http://www.harilelahospitality.com/ The Ambassador Transit Lounge offers passengers a spacious, yet cosy, environment where you can unwind and wait in comfort for your next flight. In-lounge facilities include printing services, workstations, gym, shower facilities and amenities, as well as private napping suites. SERVICE TYPE NO. OF HOURS RATE Lounge Use Adult 3 hours S$55 5 hours S$97 10 hours S$195 Child (above 2 years old) 5 hours S$55 Child (below 2 years old) Complimentary Private Nap Room Adult 6 hours S$120 Extension per hour S$15 Facilities at Hub & Spoke Location: Hub & Spoke (Public area beside Terminal 2) Operating hours: 7:30 am to 10:00 pm daily Map The facilities at Hub & Spoke offers an alfresco setting for travellers to rest and enjoy a meal before or after their flight. Travellers who flash a valid boarding pass or proof of itinerary within 8 hours of stated arrival or departure time will be entitled to a 20% discount off all food and drinks (except alcohol) at Hub & Spoke Café and Overflow. Travellers can also enjoy complimentary Wi-Fi and digital reading materials, or purchase add-ons on site. Facility Price Location Pay-per-use Showers S$5 Single-entry S$7 Two-time entry Purchase at the entrance of the shower facility Disposable towels S$4.50/piece Purchase from vending machines at the entrance of shower facility Pay-per-use Gym From S$7.50/session Purchase at Exercise Pods (Gym Pod) Pay-per-use class-based fitness activity From S$10/session Purchase at Exercise Pods (Flow Pod) Bicycle Rental From S$8/hour Purchase at the bicycle rental shop (GoCycling) Operating hours: Monday to Friday: 10:00 am - 8:00 pm Saturday, Sunday and Public Holidays: 9:00 am - 9:00 pm Terminal 3 Ambassador Transit Lounge Location: Terminal 3, Level 3, Departure Transit Hall (next to the Movie Theatre) Operating Hours: 24hrs, daily Tel: +65 6507 9798 Map Email: atl@harilelahospitality.com Website: http://www.harilelahospitality.com/ The Ambassador Transit Lounge offers passengers a spacious, yet cosy, environment where you can unwind and wait in comfort for your next flight. Guests can make use of the printing services, workstations, gym, shower facilities and amenities, beauty and massage services, as well as private napping suites. SERVICE TYPE NO. OF HOURS RATE Lounge Use Adult 3 hours S$55 5 hours S$97 10 hours S$195 Child (above 2 years old) 5 hours S$55 Child (below 2 years old) Complimentary Private Nap Room Adult 6 hours S$120 Extension per hour S$15 Terminal 4 Blossom - Sats & Plaza Premium Lounge Location: Terminal 4, Departure Transit Hall, Level 2M (near 7-Eleven) Operating Hours: 24hrs, daily Tel:+65 6581 3073 Map The Blossom Lounge offers catering services, shower facilities and a hospitality area, where you can have a massage, manicure or pedicure before your flight. You can also get your favourite beverages at the bar. SERVICE TYPE NO. OF HOURS RATE Lounge Use Adult 3 hours S$55 5 hours S$97 10 hours S$195 Child (above 2 years old) 5 hours S$55 Child (below 2 years old) Complimentary Napping Plus with Massage Adult 3 hours S$96 Massage Facilities Adult 15 minutes S$18 30 minutes S$30 60 minutes S$54 J",
    "word_count": 1499
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/transport-and-directions/coach-to-johor-bahru.html",
    "title": "Coach to Johor Bahru",
    "content": "Coach to Johor Bahru COACH TO JOHOR BAHRU Going across the causeway is easy with these coach services to Johor Bahru. Travel seamlessly between Changi Airport and Johor Bahru with Transtar Cross Border Services, operated by Transtar Travel. Transtar Cross Border Coach Services to Johor Bahru TS1: Changi Airport—Johor Bahru CIQ (via Woodlands Checkpoint) ONE-WAY FARES TS1 Adult Child From Changi Airport to Johor Bahru CIQ S$11 S$5.50 From Johor Bahru CIQ to Changi Airport RM13 RM6.50 Book your coach tickets to Johor Bahru with https://www.transtar.travel/. Payment can be made in local currency (depending on boarding point) by cash or EZ-link card only. No change will be given and all tickets sold are non-refundable. SERVICE TIMINGS TS1 (6 daily return services) Service Timing First Bus from Changi Airport 8:15 AM Last Bus from Changi Airport 9:15 PM First Bus from Johor Bahru 5:00 AM Last Bus from Johor Bahru 7:15 PM CHANGI AIRPORT TS1 PICK-UP POINT Terminal 1 Arrival Coach Bay B / C Terminal 4 Arrival Coach Bay 7 / 8 If you are at Terminal 2 or 3, please make your way to Terminal 1 Arrival Hall Coach Bay to board the bus. Important Notes: Passengers are advised to wait at the pick-up point at least 10 minutes before the scheduled departure time. All times are approximate, and the schedules and routes are subject to change without notice due to traffic conditions, especially at respective Customs. Online schedule may differ from published schedules due to unexpected additional or removal of time slots. Please refer to Transtar Travel's website for the latest TS1 schedules. We recommend that you contact Transtar Travel at +65 6297 9009 to confirm your preferred departure time at least 24 hours prior to departure to avoid any delay. For more information, please approach Transtar Travel's counter (daily operating hours: 8:15 AM–5:00 PM) located at the Arrival Hall of Terminal 1 (#01-K2), or at any of the Information Counters located at the arrival halls. Other Links Getting to the Airport Leaving the Airport Transfer between Terminals & Jewel Shuttle Services Related Links Arriving Departing Transit Special Assistance Facilities and Services FREQUENTLY ASKED QUESTIONS ABOUT COACHES TO AND FROM JOHOR BAHRU How do I book a coach ticket from Changi Airport to Johor Bahru, and can I do it online? Booking a bus ticket online is straightforward and convenient. Simply visit the Transtar Travel website, and on the homepage, select whether you need a one-way or return ticket. Specify your departure from Changi Airport and your arrival in Johor Bahru (JB), then choose your travel date. Browse through the available coach services and select the one that best suits your schedule. Next, indicate the number of tickets you need and provide passenger details, including full name, mobile number, and email address. You'll also have the option to add travel personal accident insurance. Once all information is confirmed, proceed to make your payment to secure your booking. What are the departure times for coaches from Changi Airport to Johor Bahru, and how frequently do they run? Coaches from Changi Airport to Johor Bahru operate daily, with multiple departures spread from morning until night. Specifically, the first coach departs at 8:15 AM, and services continue with the last coach leaving at 9:15 PM. While there are several buses each day directly from Changi Airport, additional services are available from other pickup locations throughout Singapore, providing flexibility and convenience for travellers heading to Johor Bahru. What is the estimated travel time from Changi Airport to Johor Bahru by coach? The travel time from Changi Airport to Johor Bahru by coach generally takes about 2 hours. However, the duration can vary depending on traffic conditions and the time spent at customs and immigration checkpoints. Travellers should allow extra time for these variables, especially during peak travel periods. Are there any luggage restrictions or fees for luggage when travelling by coach to Johor Bahru? The allowable luggage is one piece weighing up to 15KG per person for storage in the luggage compartment, plus one hand-carry item weighing up to 7KG that can be taken onto the coach. How much does a coach ticket from Changi Airport to Johor Bahru cost? For Transtar Cross Border Services, an adult ticket costs S$11 when departing from Changi Airport to Johor Bahru CIQ. Children below 7 years old can enjoy half price rides at S$5.50. Where exactly do the coaches to Johor Bahru depart from within Changi Airport? Coaches to Johor Bahru depart from Changi Airport at the Arrival Coach Bay located at Terminal 1 pick-up point Bay B/C and Terminal 4 pick-up point Bay 7/8. If you are arriving or waiting in Terminal 2 or Terminal 3, you will need to make your way to Terminal 1's Arrival Hall Coach Bay to board your bus. Clear signage and information counters throughout the airport can assist you in finding this location easily. What are the v",
    "word_count": 1226
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information/departures.html",
    "title": "Departures",
    "content": "Departures DEPARTURE FLIGHT LISTING Keep track of departing passenger flights with live updates. Arrivals Departures Disclaimer Every effort has been made to ensure the information provided is correct. The dates, times and other details shown in the tables may, from time to time, be changed without notification. CAG and/or its agents, employees or contractors are not responsible for any incorrect information and are, therefore, not liable in any way for inaccuracies or errors. Users are advised to consult with airlines directly before travelling. Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 290
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "title": "Flight Information",
    "content": "Flight Information FLIGHT INFORMATION Keep track of flight timings with live updates. Arrival Receiving a loved one or guest? Check if the flight is on schedule and what the belt number is. Departure Have a flight to catch? Check your terminal, boarding time and gate. Useful Links Flight Information Transport Facilities Airport Map Lost & Found Wifi Access FREQUENTLY ASKED QUESTIONS ABOUT CHANGI AIRPORT'S FLIGHT INFORMATION How can I check the status of my flight at Changi Airport? Visit the Changi Arrival flight or Changi Departure flight pages, or use the Changi App for real-time flight information, including any changes to your flight schedule. Digital boards throughout Changi Airport also display the latest flight timings and status updates, making it easy for you to stay on top of your travel plans. What should I do if my flight is delayed or cancelled? In the event of a delayed or cancelled flight, please check the latest flight status through our website or mobile app, where real-time updates are readily available. It is important to stay in touch with your airline, as they will have the most current information regarding rescheduling or compensation. Are there any restrictions or requirements for international travellers departing from Changi Airport? International travellers departing from Changi Airport should be aware that restrictions and requirements can vary depending on the destination country. We recommend checking our airport’s security screening process, as well as regulations outlined by the authorities of your destination country. It’s also crucial to check with your airline for any additional requirements, such as health certifications or pre-departure testing requirements. How early should I arrive at Changi Airport before my flight? For a smooth and stress-free departure, we suggest arriving at Changi Airport at least two hours for short-haul flights and three hours for long-haul flights. This allows sufficient time for check-in, immigration clearance, and security screening, in addition to enjoying the diverse range of attractions, airport eateries, popular outlets, and relaxation facilities available. Arriving early also ensures you can navigate any unforeseen delays with ease, ensuring a more relaxed start to your journey. What amenities and services are available at Changi Airport for travellers? From airport lounges and quiet rest areas to shopping and dining options, there's something for every traveller at Changi Airport. For those looking to relax before or after their flight, Changi also features beautiful gardens, a cinema, and even a swimming pool with a Jacuzzi. Information counters and customer service representatives are also readily available to assist with any travel needs or questions you might have. How can I contact customer support for assistance with flight bookings or inquiries? For assistance with flight bookings or inquiries, Changi Airport's customer support team is always ready to assist you. You can reach us through our mobile app or by calling our customer service hotline. Our dedicated team will provide you with the necessary support, from flight information and schedule changes to general airport inquiries, ensuring your travel experience is as seamless as possible. Are there language options or tools for non-English speaking users to access flight details? Changi Airport offers multiple language options on both our website and mobile app, ensuring everyone can easily access flight details and airport information regardless of their native language. Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 749
  },
  {
    "url": "https://www.changiairport.com/en/cai.html",
    "title": "CAI",
    "content": "CAI AIRPORTS. TRANSFORMED. Read More About CAI INVESTMENT, MANAGEMENT, ADVISORY As a strategic airport investor, manager and consultant, Changi Airports International (CAI) designs integrated solutions that enable clients and partner airports to fulfil their potential of being world-class air hubs. OUR EXPERTISE Growing your traffic network We project traffic demand backed by data and work with airlines to boost an airport’s connectivity and positioning. Read more Elevating your commercial offerings We uncover an airport's latent commercial potential and design strategic plans to fully realise them. Read More Creating seamless journeys We coalesce technology and the human touch to create efficient operations and responsive airport experiences. Read More Planning for the future We engineer design and capacity planning solutions to help an airport meet future demands. Read More OUR VALUE ADD Dammam Airport A transformative journey to regain competitiveness Read more Fukuoka Airport Seizing creative opportunities during the pandemic Read More Tom Jobim International Airport Delivering an Olympics-worthy airport to welcome the world Read More Malé-Velana Airport Positioning for long-term sustainable growth Read More OUR GLOBAL EXPERIENCE 88 Airport Projects 34 Countries 155 MPPA (Combined Traffic Under Management) SINGAPORE (5) Singapore Changi Airport Seletar Airport Changi East Development Singapore Changi Airport Terminal 4 Singapore Changi Airport Terminal 5 CHINA (19) Beijing Airport Changsha Airport Chengdu Airport China-Singapore Aviation Management Academy Chongqing Airport Dalian Airport Fuzhou Airport Hainan Airport Guangzhou Airport Kunming Airport Nanjing Airport Ningbo Airport Qingdao Airport Shenzhen Airport Taiyuan Airport Wuxi Airport Xiamen Airport Yantai Airport Zhengzhou Airport INDIA (5) Bangalore Airport Durgapur Aerotropolis Mumbai Airport Nagpur Airport Greenfield Pune Airport AFRICA (22) Cabinda Airport, Angola Catumbela Airport, Angola Dundo Airport, Angola Huambo Airport, Angola Bié Airport, Angola Luau Airport, Angola Lubango Airport, Angola Luena Airport, Angola Malange Airport, Angola Mbanza Congo Airport, Angola Menongue Airport, Angola Namibe Airport, Angola Ondjiva Airport, Angola Saurimo Airport, Angola Soyo Airport, Angola Uíge Airport, Angola Cairo Airport, Egypt Addis Ababa Airport, Ethiopia Conakry Airport, Guinea Kigali Airport, Rwanda Seychelles Airport, Seychelles Entebbe Airport, Uganda EUROPE AND CIS (10) Ciampino Airport, Italy Fiumicino Airport, Italy Anapa Airport, Russia Gelendzhik Airport, Russia Krasnodar Airport, Russia Sheremetyevo Airport, Russia Sochi Airport, Russia Vladivostok Airport, Russia London Luton Airport, United Kingdom Tashkent Airport, Uzbekistan MIDDLE EAST (4) Aqaba Airport, Jordan Doha Airport, Qatar Dammam Airport, Saudi Arabia Abu Dhabi Airport, United Arab Emirates NORTH AMERICA (1) Winnipeg Airport, Canada SOUTH AMERICA (6) Belo Horizonte Airport, Brazil Brasilia, Brazil Tom Jobim Airport, Brazil Juan Santamaria Airport, Costa Rica Hato Airport, Curacao Jorge Chavez Airport, Peru REST OF ASIA AND PACIFIC (16) Brunei Airport, Brunei Techo Takhmao Airport, Cambodia Nadi Airport, Fiji Fukuoka Airport, Japan Sendai Airport, Japan Takamatsu Airport, Japan Gan Airport, Maldives Malé Airport, Maldives Hanthawaddy Airport, Myanmar Auckland Airport, New Zealand Karachi Airport, Pakistan Clark Airport, the Philippines Manila Airport, the Philippines Zamboanga Airport, the Philippines Koh Samui Airport, Thailand Cam Ranh Airport, Vietnam FIND OUT MORE ABOUT CAI About CAI We empower our clients to achieve their aspirations of becoming world-class airports. Learn more Awards & Accolades We help our clients excel and stand out from competition. Learn more Careers at CAI We nurture your career with a kaleidoscope of learning opportunities and experiences. Learn more REACH OUT TO US FOR COLLABORATION Engage with us to drive innovation and elevate airport experiences together. Contact us About CAI Our Story & Corporate Profile Accolades Our Expertise Creating Seamless Journeys Elevating Your Commercial Offerings Growing Your Traffic Network Planning for the Future Our Value Add Dammam Airport Fukuoka Airport Tom Jobim International Airport Maldives Airport Careers Job Opportunities Contact Information Legal Policies Terms of Use Personal Data Protection Policy Supplier's Code of Conduct Raising Concerns Follow Us Changi Sites : CAI Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevant",
    "word_count": 722
  },
  {
    "url": "https://www.changiairport.com/en/careers.html",
    "title": "Careers",
    "content": "Careers Come Make Magic With Us At Changi Airport Group, we turn airport touch points into seamless experiences using innovation and technology. WHY JOIN US Come make MAGIC with us Discover what it’s like working at Changi Airport Group, where we make magic happen in every aspect of our business – turning different airport touchpoints into seamless experiences with innovation and technology. Get a behind the scenes glimpse of how we have deployed innovative products such as the Auto-Dolly and a baggage tracking application, to transform our work at the airport terminals and airside. Explore Now How we make MAGIC with innovation How do we build the right culture and create spaces for employees to make magic? Tools, training, and a dash of tenacity. Employees are equipped to push the boundaries and conjure innovative solutions for the future of air travel. In our world, anything can become reality through innovation. Explore Now What MAGIC will you make tomorrow? What would you do if you were given a canvas to reimagine the future of air travel? At CAG, employees are encouraged to ask questions, test limits, and explore a plethora of possibilities to stay on top of the game and deliver world-class experiences. Explore Now Life at CAG – it’s MAGIC Hear from our employees as they share candidly about life at CAG. The spirit of camaraderie and community, office perk-me-ups, and overseas bonding trips all contribute to magic beyond the desk. Explore Now Meet our divisions View All AIR HUB AND CARGO DEVELOPMENT Airport Emergency Service Airport Management CHANGI AIRPORTS INTERNATIONAL (CAI) Changi East Development Commercial2.jpg Commercial CORPORATE Engineering and DEVELOPMENT Enterprise Performance and Development PEOPLE An Award-Winning Workplace Our People are our most important asset. That's why we push ourselves to be a better employer each year. We're Here to Help Explore our relevant links to help you get started on a career with us. Job Opportunities Meet Our Divisions Make Magic with Us The CAG story Accolades Our Teams Careers Careers with Changi Airport Group Careers with Changi Airports International Scholarships & Internships Scholarships Internships Useful Tips Hiring process FAQs Contact Information Follow Us Changi Sites : Careers Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 467
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides.html",
    "title": "Terminal Guides",
    "content": "Terminal Guides Terminal Guides Find out what each terminal offers to travellers and visitors Changi Airport's Terminals Terminal 1 Terminal 2 Terminal 3 Terminal 4 Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 232
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/map.html",
    "title": "Map",
    "content": "Map Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 208
  },
  {
    "url": "https://www.changiairport.com/en/experience/tours/free-singapore-tour.html",
    "title": "Free Singapore Tour",
    "content": "Free Singapore Tour Free Singapore Tour See Singapore in under 3 hours If you are transiting through this tiny island-state, turn your layover into an adventure with the Free Singapore Tour! For travellers with at least 5.5 hours to 24 hours to spare till your connecting flight, these 2.5-hour guided tours offer a perfect introduction to Singapore’s vibrant cityscape, rich heritage and iconic landmarks. Choose from four unique tour itineraries, each featuring curated sightseeing routes with two brief photo stops at iconic landmarks. TOUR ELIGIBILITY 1. Eligibility Requirements You are a transit or transfer passenger at Changi Airport. Your checked-in baggage should be through checked to your end destination. Your layover duration should be between 5.5 to 24 hours. Your flight schedule should meet the requirements of the tour timings (refer to Tour Schedules and Itineraries below). Please take note of the reporting time (refer to Tour Schedules and Itineraries below), and ensure there is sufficient time upon plane disembarkation to reach the registration counter. Transit passengers can only enter and exit Singapore once during their layover, in compliance with the regulations set by Immigration and Checkpoints Authority of Singapore. 2. How do I register? You can pre-book one (1) tour itinerary up to fifty (50) days prior to your intended tour date. Alternatively, you can visit our tour booth(s) in the transit area upon arrival for assistance. Please note that seats are subject to availability, and there may be a balance of seats for walk-in passengers. Upon arrival at Changi Airport, please remain in the transit area and refrain from clearing Arrival immigration as the Free Singapore Tour booths are located within the transit area. The Free Singapore Tour booths are located at: T2 TRANSIT Level2, Departure Transit Hall (Near Gate F50) Opening hours: 8:00 AM-6:00PM T3 TRANSIT Level2, Departure Transit Hall (Near Gate A1-A8) Opening hours: 8:00 AM-6:00PM 3. What do I need to join the tour? Passport, boarding passes, valid entry visa (if required) and tour booking confirmation are required for registration. Eligibility to participate in the tour is subject to entry requirements stipulated by the Immigration and Checkpoints Authority of Singapore. If you have bulky or wheeled cabin baggage, alcohol, or duty-free items, you must deposit them at a Baggage Storage counter in the transit area before checking in for the tour. Please note that fees apply for this service. Electronic devices are not permitted to be stored. They must be hand-carried during the tour. 4. Important Notes Seats are allocated on a first-come, first-served basis. Each transit passenger is permitted to reserve only one tour during their layover. Tour itineraries are subject to change, depending on weather and traffic conditions. Items such as Tobacco, cigarettes, vaporizers and e-cigarettes are not permitted on all tours, as the listed items are either banned or taxable upon entry into the Republic of Singapore. Sentosa Discovery Tour [NEW!] Experience Singapore’s southern coast and discover how Sentosa transformed from a former British military base into a vibrant leisure destination. Stay tuned! Launching on 1 August. Book Now City Sights Tour Experience the best of Singapore in this dynamic city tour! From awe-inspiring architectural wonders to lush green spaces, this tour offers a snapshot of what makes Singapore a world-class city. Book Now Singapore River and Marina Bay Sands Tour Trace Singapore’s transformation from a historic trading port to a futuristic city as you explore the iconic Singapore River and Marina Bay Sands. Book Now Heritage and Culture Tour Perfect for heritage and culture enthusiasts, this tour offers an immersive journey through Singapore’s storied past. Explore vibrant ethnic enclaves and discover a cultural diversity that defines this modern city. Book Now Book Now Tour timings and itineraries Tour Timing Tour Itinerary Reporting Time(at Booth) 10:00 AM - 12:30 PM Heritage and Culture Tour Before 8:30 AM 12:00 PM - 2:30 PM City Sights Tour Before 10:30 AM 1:00 PM - 3:30 PM Singapore River and Marina Bay Sands Tour Before 11:30 AM 3:00 PM - 5:30 PM Heritage and Culture Tour Before 1:30 PM 4:00 PM - 6:30PM1 Singapore River and Marina Bay Sands Tour Before 2:30 PM 5:00PM - 7:30PM2 Singapore River and Marina Bay Sands Tour Before 3:30 PM 6:00 PM - 8:30 PM City Sights Tour Before 4:30 PM 7:00 PM - 9:30 PM3 Sentosa Discovery Tour [NEW!] Before 5:30 PM 1Tour operates from 5 August 2025 onwards. 2Tour operates until 4 August 2025. 3Tour operates from 1 August 2025 onwards. Frequently Asked Questions​ ​1. Are the tours available every day? The tours are available daily, including weekends and public holidays. 2. When are the Free Singapore Tour booths open? The Free Singapore Tour booths are open daily. The operating hours are T2 Transit Level2, Departure Transit Hall (Near Gate F50) Opening hours: 8:00AM-6:00PM T3 TRANSIT",
    "word_count": 1814
  },
  {
    "url": "https://www.changiairport.com/en/fly/departure-guide.html",
    "title": "Departure Guide",
    "content": "Departure Guide DEPARTURE GUIDE All you need to know to ensure your journey to your destination goes without a hitch. Travel Advisories Review the travel advisories for specific destinations before departure Read more Pre-flight Check Get useful information on overseas WiFi routers, luggage allowances, and worldwide shipping. Read more Checking-In Find out more about check-in procedures and options, and get answers to check-in FAQs. Read more Immigration and Customs Learn about automated clearance, cash declarations, and where to get GST refunds. Read more Security Be aware of baggage restrictions, security screening, and limits on liquids, aerosols and gels. Read more Useful Information At Your Fingertips Save flights, travel effortlessly Check flight information and receive real-time notifications while making full use of Changi’s travel services. Read more Travel with ease, parking’s a breeze Enjoy exclusive parking promos and preferential rates when you travel. Read more Pay like a local overseas with no transaction fees Travel fuss-free with competitive rates. Read more Passport-less immigration clearance arrives at Changi Airport Read more How early can you check-in at Singapore Changi Airport? Read more Quick links ARRIVING TRANSIT​ SPECIAL ASSISTANCE​ FACILITIES AND SERVICES​ TRANSPORT​ Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off, the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy. Continue",
    "word_count": 397
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/special-assistance.html?linkedListSection=children",
    "title": "Special Assistance",
    "content": "Special Assistance SPECIAL ASSISTANCE As an inclusive airport, we provide a range of accessible facilities and services to make your travel experience extra comfortable. TRAVELLING WITH CHILDREN ASSISTANCE FOR PERSONS WITH REDUCED MOBILITY ASSISTANCE FOR PERSONS WITH INVISIBLE DISABILITY OTHER ASSISTANCE TRAVELLING WITH CHILDREN Baby Milk If your baby is travelling with you, you may bring expressed breast milk onboard the aircraft. If not, you need to store the milk in containers not exceeding 100ml. More × <h3>Baby Milk</h3> <p><strong>Q: My baby is not travelling with me. Am I allowed to bring my breast milk onboard?</strong></p> <p>If your baby is not travelling with you, we would strongly advise you to store the expressed breast milk into containers not exceeding 100ml. The containers must fit comfortably in a 1-litre resealable plastic bag. The personal LAGS items will be discarded if it is not within the permissible capacity. Nonetheless, these personal LAGS items will be subjected to additional checks at the Pre-Board Security Screening Area, prior to boarding the aircraft.</p> Strollers You may obtain one directly at any of our Information Counters across all terminals and Jewel. More × <h3>Strollers</h3> <p>Changi Airport offers complimentary use of baby strollers, on a first-come-first-served basis. You may approach the information counters to obtain one, or click <a href=\"https://changiairportbooking.com/v2/#book\"><strong>h<u></u>ere</strong></a> to book (this link leads to an external booking platform). Strollers are also available for loan at the concierge counters in Jewel. Do note that a nominal refundable deposit is required and the strollers have to be returned at 9:30 PM.</p> Family Facilities From playgrounds to baby care rooms, we have all you need to entertain and take care of your kids. Find out what we offer at each terminal. More Unaccompanied Minor Service If your child is below the age of 12 and travelling alone, you can contact your airline for unaccompanied minor service. Refer to our Airlines page for contact details. More ASSISTANCE FOR PERSONS WITH REDUCED MOBILITY Using personal mobility equipment More × <p><strong>Using personal mobility equipment</strong></p> <p>If you are planning to travel with your own personal mobility equipment, do contact your airline in advance to make the necessary arrangements. Your airline will also advise on personal mobility equipment accepted on different aircrafts, things to note when checking-in your personal mobility device, as well as time for you to be present for check-in if you are using your personal mobility equipment to the boarding gate. Find your airlines’ contact&nbsp;<a href=\"https://www.changiairport.com/en/fly/airline-information/passenger.html\"><strong>here</strong></a>.</p> <p><br _rte_temp_br=\"brEOB\"> <br> </p> Wheelchair options available More × <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"682\"> <tbody><tr><td width=\"386\" valign=\"top\"><p>At Changi, there are a range of options available to meet the specific travel needs of all passengers with reduced mobility. Choose the option that best meets your needs.</p> <p>&nbsp;</p> <p><strong>Complimentary self-assist wheelchair by Changi Airport</strong></p> <p>Changi Airport offers complimentary self-assist wheelchairs across our 4 terminals, for use by our passengers and airport visitors. These wheelchairs may be loaned from information counters at each terminal’s departure hall, transit area, and arrival hall. These wheelchairs are available for airport-use only, on a first-come-first-served basis. If you require a wheelchair before they are replenished at the information counters, please contact the staff or virtual agent at the counter to arrange a wheelchair for you. You may also click <a href=\"https://changiairportbooking.com/v2/#book\"><strong>here</strong></a> to book a complimentary wheelchair ahead of your arrival at Changi Airport.</p> <p>Complimentary wheelchairs are also available for loan at Jewel Changi Airport. You may find them at Jewel’s concierge counters.</p> <p>&nbsp;</p> <p><strong>Wheelchair service by your airline</strong></p> <p>All airlines offer wheelchair service to their passengers. To ensure your request is met by your airline, you are encouraged to book the wheelchair service from your airline and/or travel agent when you book your flight, up to at least <strong>48 hours</strong> before flight departure. Please contact your airline for assistance for requests made less than 48 hours before your flight departs.</p> <p>Airlines may facilitate passengers with differing degrees of reduced mobility according to their needs. Your airline’s Special Assistance staff may ask if you are able to walk short distances. Please note that this helps to identify the level of assistance you require, so that you can be served better. During periods of high service demand, some waiting time may also be expected for the airline’s wheelchair service.</p> <p>Addi",
    "word_count": 2535
  },
  {
    "url": "https://www.jewelchangiairport.com/en/Jewel-BeLeafers-Programme.html",
    "title": "Jewel BeLeafers",
    "content": "Jewel BeLeafers [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Jewel BeLeafers Programme Participation Period Monthly LOCATION Canopy Park / Forest Valley ×Close 4 / 9 HANDS-ON GARDENING Ever wondered how the trees and plants at Jewel are maintained? We are now offering an opportunity for interested parties to have a hands-on experience of tending to the plants at Singapore’s iconic destination, Jewel! You will get to learn more about the behind-the-scenes at the best airport in the world! Do you enjoy gardening? The BeLeafers programme offers you a hands-on experience with gardening not just at Jewel, but also at other locations in the airport community. This can double up as a great bonding activity for friends and families. Everyone is welcomed, from gardening novice to experts, you can now be a part of the team involved in the gardening sessions at Jewel and the airport. Learn basic pruning and weeding techniques, or even have a chat with our horticulture expert about all plant-related questions when you participate in the BeLeafers volunteer programme. These sessions will take you through the lush and tranquil landscapes of the Forest Valley, Canopy Park, Jewel’s external gardens and even Changi Airport nursery. Do dress comfortably as you will need to bend or squat as you tend to our plants! Sign up for the BeLeafers volunteer programme here today! *The programme is open to able-bodied participants ages 13 years old and above, and volunteers who are able to handle gardening/sharp tools. **The programme is catered for individuals. If you would like to find out more about team building programmes available at Jewel, please click here! STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 422
  },
  {
    "url": "https://www.jewelchangiairport.com",
    "title": "Experience Wonder at Jewel Changi Airport - Jewel Changi Airport",
    "content": "Experience Wonder at Jewel Changi Airport - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Your browser does not support the video tag. EXPLORE JEWEL Discover a wondrous world where nature meets retail Celebrate SG60 with Jewel Celebrate Singapore’s 60th birthday with a line-up of exciting events, special showcases, exclusive rewards, and a taste of our nation’s flavour-packed journey—all under one roof at Jewel! Play The first-of-its-kind play attractions at Jewel promise endless fun for the young and young at heart! Dine Indulge in the wide array of dining options at Jewel! Shop A world-class shopping experience awaits you at Jewel! Stay Relax, rejuvenate and be refreshed at the first YOTELAIR Hotel in Asia! Purchase Tickets for Canopy Park and the attractions Latest Promotions Grab the latest deals View more Celebrate SG60 with Jewel OCBC Mastercard Campaign JUST BETWEEN US FRIENDS Latest Promotions Grab the latest deals View more CHANGI MILLIONAIRE EXPERIENCES SPEND AND WIN BIG WITH CAPITASTAR YOUR TAX REFUND STARTS AT JEWEL Jewel Features Exclusive programmes at Jewel View more Jewel Privileges Programme Jewel Double Rewards TEAM BUILDING AT JEWEL Jewel Features Exclusive programmes at Jewel View more Venues at Jewel Wedding Venues at Jewel Attractions Buyout Featured Plants at Jewel Step out of the airport right into a lush green sanctuary, a tranquil retreat in the core of the world's best transport hub. Jewel houses more than 2,000 trees and palms, and over 10,000 shrubs covering a total area of more than 21,000sqm. There are some 120 species, originating from countries all around the globe. Learn more about the plants at Jewel today! Traveller's Guide Getting to Jewel Traveller's Information Changi Lounge Tax Refund at Jewel Jewel Privileges Programme WELCOME TO JEWEL CHANGI AIRPORT Watch the video to find out more ×Close STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 450
  },
  {
    "url": "https://www.jewelchangiairport.com/en/canopy-park.html",
    "title": "Wedding Photography at Canopy Park",
    "content": "Wedding Photography at Canopy Park [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. ×Close WEDDING PHOTOGRAPHY AT CANOPY PARK Capture your love story at the enchanting Canopy Park! From lush garden trails to thrilling slides and playful mazes, the top floor of Jewel is a stunning backdrop for your wedding shoot. Package is $188* and includes: Entry for wedding couple and up to 3 crew members to all attractions except Bouncing Net and Walking Net​ Add-on options are available at an additional charge: - Jewel Suite usage (1 hour) - Solemnisation Package *Prices stated are before GST This offer is strictly for wedding shoots. For commercial filming or photography, please email contact.us@jewelchangiairport.com Photo credits: Artcammy & Labella PHOTOSHOOT TIMESLOTS Mon - Thu (except School Holidays, On and Eve of Public Holiday): 10:00AM - 12:00PM / 7:00PM - 9:00PM Last admission is 30 mins prior to closing time LOCATION Level 5 ENQUIRE venuehire@jewelchangiairport.com HEDGE MAZE Mirror Maze Mastercard® Canopy Bridge Canopy Park < STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 314
  },
  {
    "url": "https://www.jewelchangiairport.com/en/promotion/stb-india.html",
    "title": "Enjoy exclusive promotions from STB India!",
    "content": "Enjoy exclusive promotions from STB India! [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Exclusive Promotions For Indian Visitors! Promotion Period 7 Jan - 31 Dec 2025 LOCATION Jewel Changi Airport ×Close 4 / 9 Flash your Indian passport at Jewel Changi Airport Level 1 Concierge to receive Jewel Privileges Card, a $5 Attraction Voucher and two $5 Retail Voucher. Mastercard Cardholders get to redeem an additional $5 Retail Voucher! UPI payment is accepted at all L5 Attractions. Terms & Conditions - Jewel Privilege Card has to be presented at participating outlets to enjoy the special discounts and promotions. - $5 Retail voucher is valid for use with a minimum spend of S$30 at participating retail shops in Jewel Changi Airport only. Limited to 1 voucher redemption per transaction and the voucher is not stackable. - $5 Attraction voucher is valid for online purchases of Level 5 attraction only – Mastercard ® Canopy Bridge, Hedge Maze, Mirror Maze, Walking Net and Bouncing Net. - Promotions are subject to availability and respective outlet's terms and conditions. - Please visit the respective participating outlet for the full terms and conditions. - Redemption is limited to one redemption per tourist per day, while stocks last. - Jewel Changi Airport Trustee reserves the right to amend the terms and conditions of the promotion. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 371
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/rain-vortex.html",
    "title": "Jewel Rain Vortex - Jewel Changi Airport",
    "content": "Jewel Rain Vortex - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. ×Close JEWEL RAIN VORTEX THE MARVEL AT JEWEL'S HEART The world’s tallest indoor waterfall. Come marvel at the stunning display of water cascading down 7 storeys at the heart of Jewel! Trip.com Light & Music Showcase: Mon - Thu: 8.00pm & 9.00pm Fri - Sun, PH & Eve of PH: 8.00pm, 9.00pm & 10.00pm OPENING HOURS Daily: 10:00AM - 10:00PM LOCATION Heart of Forest Valley MORE ABOUTJEWEL RAIN VORTEX Spectacular by day Flowing 40 metres down to the basement, the mighty cascade will mesmerise you as the sunlight catches the spray. Stunning by night When the sky outside darkens, the continuous pour of the Jewel Rain Vortex takes on a mystic splendour. Come nightfall, the sheet of water becomes a Light & Music Showcase. Relax at one of the many vantage points surrounding it and enjoy the show. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 305
  },
  {
    "url": "https://www.jewelchangiairport.com/en/changi-lounge.html",
    "title": "Changi Lounge - Jewel Changi Airport",
    "content": "Changi Lounge - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. CHANGI LOUNGE Located within Jewel Changi Airport, Changi Lounge provides an exclusive and comfortable environment where you can rest and relax – with Jewel’s range of exciting attractions and lifestyle offerings right at the doorstep for your exploration. In between your travel plans, enjoy free flow of light snacks, high-speed connectivity and even business facilities at Changi Lounge. There are also shower and napping amenities, for those who seek to be rejuvenated before the next leg of their journey. With wifi access available, keep yourself entertained or attend to business matters conveniently while on the go. There are also private meeting rooms available for booking. Location: Jewel Changi Airport, Level 1 (Public Area) Operating hours: Daily, 6.00AM – 10.00PM (Note: Kitchen and bar close at 9:00PM) ×Close 4 / 9 Buy Now on Changi APP Buy Now on Changi APP AMENITIES ×Close 1 / 9 TRANQUIL ENVIRONMENT TO WORK AND REST Whether you are seeking tranquil environment to work or study, or just want to rest your feet and have a cup of tea in between retail therapy, Changi Lounge is the haven for you.  There are ample power and charging points at every corner, as well as portable laptop tables to suit your working needs. ×Close 1 / 9 DELECTABLE REFRESHMENTS Enjoy free flow of light snacks and a hot meal with the choice of our Classic or Premium package. ×Close 1 / 9 Rejuvenate with a refreshing shower For those who seek to be refreshed after a flight, the lounge is equipped with shower facilities. Linen and toiletries are provided. ×Close 1 / 9 RECHARGE WITH A NAP If you need a quick shut-eye, the nap pod facility provides a comfortable space for you to re-energise yourself. With in-built high technology features, you will be able to enjoy a composed sleep and timed waking through a programmed combination of lights, music and vibration. ×Close 1 / 9 Facilities for business needs Private meeting rooms are perfect for your business meetings and work  discussions in an exclusive setting. Packages include drinks and snacks, as well as free parking. RATES FOR CHANGI LOUNGE REGULAR RATES Enjoy 3 hours of lounge access catered to your different needs. Lite Package: Adult: $28++  |   Child: $20++ •  3h lounge access •  Free flow snack bar Classic Package: Adult: $39++  |   Child: $27++ •  3h lounge access •  Free flow snack bar •  One hot meal •  One beer Premium Package: Adult: $50++  |   Child: $39++ •  3h lounge access •  Free flow snack bar •  One hot meal •  One beer •  One shower Ala-Carte Services for Add-Ons Shower Facilities (includes linen and toiletries) $20++ for a 20-minute shower slot Note: Last shower slot at 9.25pm. Nap Pod Facilities Guests with lounge package purchased $15++ (per hour, for guests with any lounge package purchased) Guests without lounge package purchased $22++ (1st hour) $18++ (subsequent hour) Note: Timeslot reservations for Shower and Nap Pod services are available over the counter only. Meeting Room Booking (Includes stationery, presentation facility and access to snack bar) Single Room (up to 4 guests): •  $80++ for one hour •  $150++ for two hours •  $250++ for four hours •  $440++ for eight hours •  Additional guest (up to 8) per hour: $10++ per guest Double Room (up to 8 guests): •  $160++ for one hour •  $300++ for two hours •  $500++ for four hours •  $880++ for eight hours •  Additional guest (up to 16) per hour: $10++ per guest To book a meeting room, please write in to reservations.changilounge@changiairport.com. Extra Perk Enjoy free parking* for 50% of guests with minimum 2 hours of meeting room booking. *Valid for Jewel / Terminal 1 carpark levels B3 to B5 only. Terms and conditions apply. Note: Priority Pass (including LoungeKey and LoungeKey Pass), Dragon Pass and DreamFolks members are accepted with valid boarding pass. Terms & Conditions apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 815
  },
  {
    "url": "https://www.jewelchangiairport.com/en/Jewel-Vouchers.html",
    "title": "Jewel Vouchers - JEWEL CHANGI AIRPORT",
    "content": "Jewel Vouchers - JEWEL CHANGI AIRPORT [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Jewel Vouchers LOCATION Jewel Changi Airport ×Close 4 / 9 Gift Voucher Terms & Conditions: - This voucher is valid for use with no minimum spend at participating shops, restaurants and attractions in Jewel Changi Airport only (excluding YOTELAIR Singapore Changi Airport, Apple, Dyson Demo Store Service Centre, Fun Claw, kcuts, Solace Studio, Luckin Coffee, Minmed Wellness Collective, RICH & GOOD CAKE SHOP™ SINCE 1997, GIFT by Changi Airport and Changi Experience Studio). - This voucher is not for sale. - This voucher is not refundable and exchangeable for cash, and cannot be replaced if lost, damaged or expired. - Vouchers cannot be used at event outposts operated by non-tenants. - Any alteration(s) on the voucher will not be accepted. - Jewel Changi Airport reserves the right to vary the voucher’s terms and conditions and/or cease the acceptance of the voucher without prior notice. Retail Voucher Terms & Conditions: - This voucher is valid for use with a minimum spend of S$30 at participating retail shops in Jewel Changi Airport only. - This voucher is not refundable and exchangeable for cash, and cannot be replaced if lost, damaged or expired. - Limited to 1 voucher redemption per transaction and the voucher is not stackable. - Vouchers cannot be used at event outposts operated by non-tenants. - Any alteration(s) on the voucher will not be accepted. - Jewel Changi Airport reserves the right to vary the voucher’s terms and conditions and/or cease the acceptance of the voucher without prior notice. Participating Tenants - Beauty and Wellness : Amaris, Bath & Body Works, Cuttour Hair Studio, Dragon Brand Bird's Nest, Eu Yan Sang, Maison Margiela, Montale Paris, Natureland Spa. Premium, Nectarlife | Pearl de Flore, Pearly Lustre, Ogawa Bespoke, OSIM, Owell, SkinGO!, Sasa, Watsons. - Children and Maternity : FILA KIDS, Le Petit Society, My Greatest Child. -  Fashion : Calvin Klein, COACH, Desigual, Evisu, Fred Perry, Goelia, Goelia Since 1995, Hurley, I'M IN, Kate Spade, LIOU&LANS, Massimo Dutti, Polo Ralph Lauren, Setirom, The Shirt Bar, The Tinsel Rack, Timberland, Traveller World, UNIQLO, ZARA. -  Handbags, Shoes and Accessories : Aldo, Birkenstock, Boarding Gate, CHARLES & KEITH, Crocs, ECCO, Furla, Lovisa, Marhen J & Sift & Pick, MOTHERHOUSE, Onitsuka Tiger, PAZZION, PEDRO, Red Wing Shoe Store, Sam Edelman, Teva -  Jewellery and Watches : Black by Blue Brave, Chomel, CHOW TAI FOOK, Grand Seiko, G Shock, Satellite Paris, SK Jewellery, Tag Heuer, TUDOR. -  Lifestyle and Gifts : ActionCity, AWHSOME by Hyggerium, Challenger, DJI, GIFT by Changi Airport, I ❤️ SG, MINISO, MUJI, Otaku House, Pokémon Center Singapore, POP MART, Pop Up! Jump Characters Store in Singapore, Sanrio, Simply Toys, Smiggle, The Digital Gadgets, The Wonder Store, Toys' R Us, Beryl's Chocolate -  Optical : Lenskart, Oakley, OWNDAYS, Ray-Ban, Spectacle Hut Boutique. -  Sports : adidas, ASICS, Columbia, Converse, DESCENTE, Foot Locker, FILA Flagship S.E.A, New Balance, New Era, Nike, OYSHO, Salomon, Skechers, Sun Paradise, Weston Corp, Salomon, Wilson - Supermarket: Fairprice Finest, DON DON DONKI. Breakfast Voucher Terms & Conditions: •This voucher is valid for use with a minimum nett spend of S$12 at participating shops in Jewel Changi Airport, from 6am – 9.59am only (shown in receipt). •Voucher is valid only between 6:00am and 9:59am at billing time. •Applicable for in-store promos and discounted items. •Limited to 1 voucher redemption per transaction. •Any alteration(s) on the voucher will not be accepted. •This voucher is not refundable and exchangeable for cash, and cannot be replaced if lost, damaged or expired. •Vouchers cannot be used at event outposts operated by non-tenants. •Please refer to www.jewelchangiairport.com for the full list of participating outlets and terms and conditions. •Jewel Changi Airport reserves the right to vary the voucher’s terms and conditions and/or cease the acceptance of the voucher without prior notice. Participating Tenants - Cafes & Coffee : 7Cafe, ActionCity Cafe, Kenangan Coffee, Keong Saik Bakery, Starbucks, The Coffee Bean & Tea Leaf, Toast Box, Ya Kun Kaya Toast, Ipoh Town 怡保城茶室, Cafe Kitsune, PAUL Bakery & Restaurant, Twenty Loaf Toasties - Fast Food & Quick Bites : A&W, KFC, McDonald's, Shake Shack -  Asian & Local Delights : Tsui Wah, The Hainan Story, Old Chang Kee, Song Fa Bak Kut Teh, Munchi Pancakes, Thye Moh Chan -  Bakeries & International Delis : Paris Baguette, Keong Saik Bakery, PAUL Bakery & Restaurant, Twenty Lo",
    "word_count": 913
  },
  {
    "url": "https://www.jewelchangiairport.com/en/Your-Tax-Refund-Starts-At-Jewel2.html",
    "title": "Your Tax Refund Starts At Jewel",
    "content": "Your Tax Refund Starts At Jewel [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Your tax refund starts at Jewel Promotion Period Ongoing LOCATION Jewel ×Close 4 / 9 Enjoy more savings* when you shop at Jewel Changi Airport! Claim your tax refund* back when you shop at Jewel at the following retail stores: Action City, Agnes B, Aldo, Apple, Asics, Bath & Bodyworks, Boarding Gate, Bee Cheng Hiang, Calvin Klein, Challenger, Charles & Keith, Chomel, Coach, Converse, Columbia, Crocs, Converse, Descente, DJI, Don Don Donki, Dragon's Brand Bird Nest, Dyson, Ecco, Eu Yan Sang, Fairprice, Fila, Fila Kids, Foot Locker, Fred Perry, Godiva, Goelia, Goelia Since 1995, Hurley, Kate Spade, Kele, Kim's Duet, Laderach, Lenskart, Le Petit Society, Massimo Dutti, Motherhouse, New Balance, New Era, NIKE, Oakley, Ogawa Bespoke, Onitsuka Tiger, OSIM, Oysho, OWNDAYS, OWELL, Pandora, PAZZION, PEDRO, Pokemon, POP MART, POLO Ralph Lauren, Ray-Ban, Sasa, Sanrio, Satellite Paris, Simply Toys, Smiggle, Skechers, Spectacle Hut, Sun Paradise, The Shirt Bar, The Wonder Store, Timberland, Tong Garden, TOYS R US, UNIQLO, Capsule by Watches of Switzerland, Watsons, Western Corp, Traveller World, ZARA STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 334
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/forest-valley.html",
    "title": "Forest Valley - Jewel Changi Airport",
    "content": "Forest Valley - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. ×Close FOREST VALLEY EXPLORE ETERNAL SPRING WITHIN JEWEL Step out of the airport right into a lush green sanctuary, a tranquil retreat in the core of the world's best transport hub. Immerse yourself in this garden wonderland and meet Singapore, the City in a Garden. OPENING HOURS Open daily: 24 hours LOCATION Forest Valley: Entry and exit points between Level 1 to Level 4 Practical Information Allow half an hour for each trail, at a comfortable pace with ample time for photo-taking. There are several exit points and seats along the way. Luggage and wheeled bags are not allowed, but can be left at our baggage storage. - Suitable for all ages - High heels not recommended MORE ABOUTFOREST VALLEY Forest Valley Explore idyllic landscapes bathed in natural sunlight, a spectacular waterfall at the core. You'll discover intriguing plants from all around the world, with more than 900 trees and palms, and about 60,000 shrubs in this verdant indoor garden. Walking Trails Take a gentle hike up through the Forest Valley to the Canopy Park on Jewel's topmost level. The eastern trail leads you past rocky falls, while mists enhance your trek through the western trail. Admire the wide vistas across the Forest Valley and find enchantment at every turn. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 376
  },
  {
    "url": "https://www.jewelchangiairport.com/en/promotion.html",
    "title": "Promotions - Jewel Changi Airport",
    "content": "Promotions - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Promotions You're never short of a good deal when you visit Jewel. Be tempted by these exciting offers exclusively at Jewel! View Filters Reset APPLY FILTERS Clear All See More STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 195
  },
  {
    "url": "https://www.jewelchangiairport.com/en/Jewel-Double-Rewards.html",
    "title": "Double Rewards - Jewel Changi Airport",
    "content": "Double Rewards - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Jewel Double Rewards The ONLY mall in Singapore serving up to 4.5% rebate - HIGHEST cashback reward at Jewel Changi Airport!* From 8 July 2025, receipt scanning on the CapitaStar app will no longer be available. Continue to earn STAR$® with CapitaStar at Jewel and enjoy Double Rewards by linking your Changi Rewards and CapitaStar accounts today! Enjoy Double Rewards in 4 simple steps: ×Close 4 / 9 Click here for Jewel Double Rewards FAQ. *Based on nett spending of $1,000 by a Double Rewards shopper who is a Changi Rewards Monarch member. Terms & Conditions apply. MORE ABOUT JEWEL DOUBLE REWARDS Changi Rewards Not just rewards, but a leap into a world of exclusive privileges. The loyalty programme that rewards you when you shop and dine at Changi Airport and Jewel. Sign up for Changi Rewards today. Sign Up Now CapitaStar Explore a Universe of Rewards with CapitaStar - Singapore's leading lifestyle app which rewards you on your everyday spend. Simply shop and spend a min. of $10 at Jewel to start earning! Sign up Now Pay with ChangiPay ×Close 4 / 9 Pay and earn Changi Rewards points with one scan at Jewel! Stores Accepting ChangiPay at Jewel Stores Accepting ChangiPay at Jewel USE YOUR E-VOUCHERS TODAY! Changi Rewards e-Voucher Flexi Redeem your e-Voucher Flexi with Changi Rewards points to offset your purchases at Jewel today! MORE eCapitaVoucher Redeem your eCapitaVoucher with STAR$ and use it at the participating outlets when you shop and dine here! MORE STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 415
  },
  {
    "url": "https://www.jewelchangiairport.com/en/playatjewel-corporate.html",
    "title": "PlayatJewel - Corporate",
    "content": "PlayatJewel - Corporate [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Corporate Membership ×Close 4 / 9 Reward your employees through Jewel Changi Airport’s corporate membership. Enjoy year-round unlimited admission to Canopy Park, Mastercard® Canopy Bridge, Hedge Maze, Mirror Maze, Bouncing Net and Walking Net! If you have any questions, kindly refer to our FAQ section or contact us via email at sales@jewelchangiairport.com. DOWNLOAD APPLICATION FORM DOWNLOAD APPLICATION FORM Please email the endorsed application form to: sales@jewelchangiairport.com Email subject: Corporate Membership Application (Company Name) Corporate Membership Plan ×Close 4 / 9 Corporate Membership Plan The Corporate Annual Pass entitles your staff and three accompanying guests to enjoy unlimited admission to Canopy Park and one time entry per day to Mastercard® Canopy Bridge, Hedge Maze, Mirror Maze, Walking Net and Bouncing Net. ×Close 1 / 9 Annual Corporate Membership (Price per card) 1 Physical Card      - $4,780 2 Physical Cards    - $4,000 3 Physical Cards    - $3,500 4 Physical Cards    - $3,000 Add on: Corporate E-Letter Scheme Staff located in multiple locations? Physical cards too much of a hassle? The Corporate E-Letter scheme maximises your company’s investment in the membership by: Issuing an electronic version of the membership in the form of an authorisation letter Minimising the administrative hassle of managing physical cards Maximising the utilization of the membership during the peak season by allowing a faster turnaround time of the membership card among your staff This scheme is available upon sign up of your corporate membership, subject to an additional annual fee of $3,230 per membership card. For those who like to trial our membership, a six months Season Corporate Membership programme is available! 6 Months Season Corporate Membership (Price per card) 1 Physical Card - $2,680 Add on Corporate e-letter at $1,800 Corporate Pass Holders Year Long Perks Shop & Dine Rest & Relax Explore & Play Enjoy exclusive promotion(s) at selected outlets in Jewel Changi Airport. JEWEL Privileges Retail and F&B Discounts Gift by Changi Airport: 10% off with min. $5 spend Click here for more info Rest & Relax at Changi Lounge or enjoy exclusive discounts for your staycation! 10% off for Changi Lounge Access Up to 20% at participating hotels (Crowne Plaza Changi Airport, Dusit Thani Laguna Singapore & YOTELAir Singapore Changi Airport) Click here for more info ADDITIONAL TICKET DISCOUNT FOR FAMILY & FRIENDS 20% off Singapore Resident Individual attraction tickets, Jewel-rassic Quest and Bundle Deals* *Up to 10 tickets to be purchased onsite via Jewel L5 Concierge Click here for more info Terms and Conditions USE OF CORPORATE ANNUAL PASS Passholder may enjoy the privileges and benefits stated here. Passholder must be present on-site with his/her valid corporate staff ID to enjoy the privileges and benefits. Privileges and benefits are offered at the sole and absolute discretion of Jewel Changi Airport and they are non-transferable and non-assignable. Corporate Annual Pass admissions: Each corporate annual pass entitles your staff to enjoy unlimited admission to Canopy Park and one time entry per day to Mastercard® Canopy Bridge, Hedge Maze, Mirror Maze, Bouncing Net and Walking Net for up to one staff and three accompanying guests (adult/child/senior) per day. A valid physical membership card or corporate e-letter must be presented along with corporate staff ID to be granted admission to the attractions or in order to enjoy the Attractions Pass privileges. All children under 12 must be accompanied by an adult. Admission to the various Jewel Changi Airport attractions using the Corporate Annual Pass is subject to blackout dates; closure of attractions due to maintenance or force majeure events; and separate ticketed events. Please refer to the Jewel Changi Airport Attractions website for more information. The use of the Corporate Annual Pass for admission into Jewel Changi Airport’s attractions is subject to the applicable terms and conditions of the attractions. All Passholders and users of the Corporate Annual Pass agree to Jewel Changi Airport’s attractions terms and conditions. Please refer to the full terms & conditions of the Jewel Changi Airport’s attractions here. Click here for the full Terms & Conditions. Frequently Asked Questions (FAQ) General FAQ 1.      What is Jewel Corporate Membership? Jewel Corporate Membership is the official membership programme offered to corporate companies by Jewel Changi Airport. As a member, corporate c",
    "word_count": 1614
  },
  {
    "url": "https://www.jewelchangiairport.com/en/Weddings-at-Jewel.html",
    "title": "Weddings at Jewel - Jewel Changi Airport",
    "content": "Weddings at Jewel - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. SAY 'I DO' AT JEWEL With its iconic architecture, amazing indoor gardens, one-of-a-kind attractions, and unique shopping and dining options, Jewel Changi Airport is the ideal venue for your wedding celebrations. Exchange your vows against the backdrop of the world's tallest indoor waterfall - Jewel Rain Vortex and the lush greenery of the Forest Valley,  or capture unforgettable memories in the cool comfort of a beautiful garden complete with a floral arch for your picture-perfect wedding at Jewel. OUR WEDDING VENUES ×Close 1 / 9 Floral Arch If you have always dreamed of having your wedding reception in an air-conditioned garden environment, we have the perfect location for you! Jewel's Canopy Park is now available for wedding engagement bookings, and it even comes with a floral arch for that picture perfect \"I Do\" moment! Enquire now: venuehire@jewelchangiairport.com Download the FAQ View Virtual Tour LOCATION Level 5 Canopy Park Jewel wedding ebrochure FY2324 SPECIFICATION 120 sqm Up to 20 guests Complimentary access to Canopy Park Setup not included in the package ×Close 1 / 9 JEWEL SUITE Located at level 4 of Jewel, the Jewel Suite is a private lounge that comes fully equipped with amenities such as a TV lounge, bar counter, private room, and a balcony that has unparalleled views of the Jewel Rain Vortex. There are also toilet and bathing facilities within the Jewel Suite. With a luxurious interior and fittings, the Jewel Suite is the perfect spot for couples who seek a private setting with a sense of intimacy. Service staff will also be stationed in the room to assist with guests' needs. Enquire now: venuehire@jewelchangiairport.com Download the FAQ View Virtual Tour LOCATION Level 4 Jewel wedding ebrochure FY2324 SPECIFICATION 125 sqm Up to 25 guests Complimentary light snacks and beverages (Coffee, Tea, Soft Drinks) Service staff stationed in the suite to assist with guests' needs F&B Catering Packages available Amenities: - Main lounge - TV Lounge (Loewe TV) - Private Room - Bar Counter - Private balcony with views of the Jewel Rain Vortex - Toilet and bathing facilities ×Close 1 / 9 CLOUD9 PIAZZA An iconic landmark in Singapore where lush nature meets stunning architecture, Jewel Changi Airport is a one-of-its-kind venue for every occasion. Hold celebrations at the top level of this architectural wonder, against the backdrop of the breathtaking Jewel Rain Vortex. Be captivated by the magical garden sanctuary and bask in the glorious natural light, and as the skies turn from dusk to dawn, celebrate the start of your new chapter in life. At a sizeable 1,000 sqm, Cloud9 Piazza offers abundant customisable opportunities to make your dream wedding come true. Enquire now: cloud9piazza@changiairport.com LOCATION Level 5 DOWNLOAD WEDDING RECEPTION PACKAGES SPECIFICATION 1,000 sqm 100 – 200 guests Hedges planters for privacy Click here for the 360 view of Cloud9 Piazza ×Close 1 / 9 Valley View Private Suite Hold an intimate solemnisation at the elegant Valley View Private Suite, which is tucked away from public view. Enclosed with a private open balcony overlooking the Forest Valley, the idyllic views of the valley’s lush greenery complete the romantic garden theme. Couples hosting a smaller group of guests will find the suite’s size and cushy fit-out perfect. A cosy tea reception is also possible with the support of a comprehensive panel of catering partners. Enquire now: cloud9piazza@changiairport.com LOCATION Level 4 DOWNLOAD SOLEMNISATION PACKAGES SPECIFICATION 92 sqm Up to 20 guests STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 734
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/discovery-slides.html",
    "title": "Discovery Slides - Jewel Changi Airport",
    "content": "Discovery Slides - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. ×Close DISCOVERY SLIDES INTERACT WITH ART It's a work of art; it's a playground; it's a viewing deck… Discover for yourself the different ways to enjoy this giant sculptural playscape! OPENING HOURS Mon - Thu: 10:00AM - 9:00PM Fri - Sun, PH & Eve of PH: 10:00AM - 10:00PM Last admission is 30 mins prior to closing time LOCATION Canopy Park (L5) Practical information Recommended attire: - Pants or shorts - Comfortable covered shoes Luggage and wheeled bags are not allowed for safety reasons. Please leave your bags at the baggage storage. Discovery Slides Canopy Park ticket includes: 1. Discovery Slides# 2. Foggy Bowls 3. Petal Garden 4. Topiary Walk Standard Rate Adult/Child - SGD 8 Singapore Residents* Adult/Child/**Student/Senior - SGD 6 CapitaStar Members & Changi Rewards Members Special Rate [Available at Jewel Concierge Counters (L1, 2, 5)] Adult/Child/**Student/Senior - SGD 5.40 Child: 3 - 12 years old | Senior: 60 years old and above All Child ticket holders must be accompanied by a paying Adult. # Minimum height requirement is 110cm. * Applicable for Singapore citizens, permanent residents, employment pass, work permit and dependent pass holders. Proof of residency may be required at the point of ticket purchase and upon admission. **Current students of local Universities, Polytechnics, Junior Colleges, Institutes of Technical Education and Secondary School holding a valid student photo ID are eligible to purchase student ticket. Verification will be done at the point of entry. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 1 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# Standard Rate Adult - SGD 39  |  **Child - SGD 29 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult #Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 2 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# 6. Bouncing Net^# Standard Rate Adult - SGD 54  |  **Child - SGD 39 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 3 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 56  |  **Child - SGD 40 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 4 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# 7. Bouncing Net^# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 71  |  **Child - SGD 50 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES *Terms and Conditions apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cook",
    "word_count": 827
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/ces.html",
    "title": "Changi Experience Studio - Jewel Changi Airport",
    "content": "Changi Experience Studio - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. VIEW PHOTOS ×Close CHANGI EXPERIENCE STUDIO A JOURNEY OF FUN AND DISCOVERY Go on a journey of fun and discovery through the exciting virtual world of Changi Airport! Engage in the wonder of amazing projection experiences and enjoy interactive games and immersive shows. In this first-of-its-kind digital attraction, experience the magic of technology and learn about aviation and what makes the airport tick. For general enquiries on ticketing or admission, please email to ces.enquiry@changiairport.com. For event booking enquiries, please email to ces.sales@changiairport.com. For learning journeys and visits by schools or corporate groups, please email learn@changiairport.com. OPENING HOURS Mon - Fri : 11:00AM - 8:00PM （Last admission at 7.00PM) Sat, Sun & PH: 10:00AM - 8:00PM （Last admission at 7.00PM) LOCATION L4 MORE ABOUTCHANGI EXPERIENCE STUDIO A JOURNEY OF FUN AND DISCOVERY Explore and enjoy 20 different interactive touchpoints over 10 content zones. Learn about the history and development of Changi, go behind the scenes of its operations and play games simulating airport functions. A fascinating journey of discovery and play for both adults and children alike. Find out more JOIN US FOR A LEARNING ADVENTURE Changi Experience Studio tells the stories of Changi Airport and gives a glimpse into what lies behind the success of Singapore’s air hub. Besides being a showcase of digital innovation in edutainment and experience creation, the studio also offers a specially curated range of programmes for both adults and students to gain a deeper understanding of how Changi Airport is managed and its innovation journey. Find out more about its programmes. Find out more CELEBRATE SINGAPORE'S BIRTHDAY WITH A GREAT BUNDLE DEAL Celebrate Singapore’s 60th birthday with our Great Bundle Deal of 6 tickets for only S$60 at Changi Experience Studio. Senior citizens aged 60 years old and above can also purchase tickets at $6 each. Available from 14 March 2025, all local residents can enjoy this promotion when they purchase the tickets at the attraction’s ticketing counter. Explore, play and discover all about the nation’s icon – Changi Airport, as you play airport-themed games. Hurry, call up your family and friends to enjoy a fun day out at Changi Experience Studio - the more the merrier! Singapore Residents* Tickets Adult - SGD 19.80  |  Child/Senior - SGD 14.80 Terms and Conditions: Sale and visit period is from 14 March to 30 September 2025. Sale of discounted bundle tickets is only available for counter purchase at Changi Experience Studio (Level 4), and not available online. Discount bundle is only applicable for Singapore residents only. Promotion is only available in a bundle of 6 Singapore Residents tickets. Tickets bought under this promotion allow for single entry to Changi Experience Studio. No refund or exchange on unused tickets. [Advisory] Changi Experience Studio will be closed for a private event on 1 August, 5pm to 8pm (last entry at 4pm). TAKE FLIGHT AT CHANGI AIRPORT BUNDLE Buckle up and enjoy double the fun with two exciting adrenaline-filled aviation adventures rolled into one amazing bundle deal! Featuring two exciting attractions: a 15-minute flight simulator flying experience brought into Changi Experience Studio from a real flight school - Aeroviation, plus entry to the fun airport-themed digital attraction, ‘Take Flight at Changi Airport’ Aviation Experience allows you to experience the thrill of piloting an aircraft over Singapore’s skyline in a flight simulator and learn all about Changi Airport through fun and games! ‘Take Flight at Changi Airport’ Aviation Experience Bundle Promo Rate Adult - SGD 51.80 (U.P. SGD64)  |  Child/Senior/ Student^ - SGD 49.80 (U.P. SGD56) Important Notes: ‘Take Flight at Changi Airport’ Aviation Experience Bundle includes a single entry to Changi Experience Studio and a 15-minute Flight Simulator experience. Participants of Aeroviation Flight Simulator must be at least 7 years old with a minimum height of 110cm Participants are to book their Flight Simulator experience to ensure availability of slots before the visit to Changi Experience Studio as both experiences must be on the same day Please note that the Flight Simulator can only accommodate one (1) person at a time. If there is more than 1 person participating in the Flight Simulator, you will have to book the next available time slot (subject to availability). Purchase of Aviation Experience Bundle is valid for two (2) months from da",
    "word_count": 1848
  },
  {
    "url": "https://www.jewelchangiairport.com/en/Canopyparkpromotions.html",
    "title": "Canopy Park Ticket Promotions - Jewel Changi Airport",
    "content": "Canopy Park Ticket Promotions - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. ×Close 1 / 9 BIRTHDAY MONTH FREE CANOPY PARK ADMISSION 1x Free Canopy Park Admission for Changi Account member during your birthday month! Term and Conditions Apply. Valid till 31 March 2026. ×Close 1 / 9 DBS/POSB CARDS PROMOTION Enjoy 25% off Standard admission rates to all attractions except Canopy Park, 20% off Jewel-rassic Quest, 20% off Bundle Deals 1 and 2, and 10% off PlayAtJewel Membership when you key in the exclusive promo code from DBS/POSB listed here before making payment. Buy your tickets here! Terms & Conditions apply. Valid till 30 June 2026. ×Close 1 / 9 HOMETEAMNS PROMOTION Enjoy 10% off Individual Attractions Singapore Residents rates and 25% off Jewel-rassic Quest Singapore Residents rates, when you enter the promo code from HomeTeamNS listed here when purchasing the tickets online via Jewel’s Ticketing website. Discount is not valid for Canopy Park and Bundle Packages 1 to 4 on Jewel’s Ticketing website. Terms & Conditions apply. Valid until 31 December 2025. Buy your tickets here! ×Close 1 / 9 JCB CARDHOLDERS PROMOTION Enjoy 25% off Standard Individual attraction tickets (Excluding Canopy Park & Jewel-rassic Quest) and 20% off Bundle Deal 1 and 2, when you present your JCB card at L1 Concierge or L5 Ticketing Counter. Terms & Conditions apply. Valid until 31 October 2025. Buy your tickets here! ×Close 1 / 9 KEPPEL ELECTRIC PROMOTION Get 15% off Standard Individual Attraction Tickets (Exclude Canopy Park & Bundle Deals) when you key in the exclusive promo code from Keppel Electric listed here before making payment. Get 15% off Jewel-rassic Standard ticket too! Buy your tickets here! Terms & Conditions apply. Valid until 31 December 2025. ×Close 1 / 9 PASSION CARD PROMOTION Get 10% off Singapore Residents Rate (Exclude Canopy Park & Bundle Deals) when you key in the exclusive promo code from PAssion listed here before making payment. Get 25% off Jewel-rassic Quest Singapore Residents ticket too! Buy your tickets here! Terms & Conditions apply. Valid until 31 December 2025. ×Close 1 / 9 SAFRA PROMOTION Get 10% Off Individual Attraction Singapore Resident rates (Exclude Canopy Park & Bundle Deals) when you key in the exclusive promo code from SAFRA before making payment. Get 25% off Jewel-rassic Quest Singapore Resident rates too! Buy your tickets here! Terms & Conditions apply. Valid until  31 December 2025. ×Close 1 / 9 UOB CARD PROMOTION Enjoy 25% off Standard admission rates to all attractions except Canopy Park, 20% off Jewel-rassic Quest and 20% off Bundle Deals 1 and 2, and 10% off PlayAtJewel Membership when you key in the exclusive promo code from UOB before making payment. Buy your tickets here! Terms & Conditions apply. Valid till 30 Apr 2026. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 617
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/walking-net.html",
    "title": "Walking Net - Jewel Changi Airport",
    "content": "Walking Net - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. ×Close WALKING NET BALANCE YOUR WAY THROUGH AN ADVENTURE Suspended across a void, this is one walk you won't forget. A taut web 25 metres above ground affords an indescribable sensation of lightness. OPENING HOURS 10:00AM - 9:00PM Last admission is 30 mins prior to closing time LOCATION Canopy Park (L5) Practical information Recommended attire: - Pants or shorts - Comfortable covered shoes Luggage and wheeled bags are not allowed for safety reasons. Please leave your bags at the Baggage Storage. Walking Net Walking Net# ticket includes admission to Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk). Standard Rate Adult - SGD 18.90 Child - SGD 13.90 Singapore Residents* Adult - SGD 15.90 Child/**Student/Senior - SGD 10.90 CapitaStar Members &  Changi Rewards Members Special Rate [Available only at Jewel Concierge Counters (L1, 2, 5)] Adult - SGD 14.30 Child/**Student/Senior - SGD 9.80 Child: 3 - 12 years old | Senior: 60 years old and above All Child ticket holders must be accompanied by a paying Adult. # Minimum height requirement is 110cm. * Applicable for Singapore citizens, permanent residents, employment pass, work permit and dependent pass holders. Proof of residency may be required at the point of ticket purchase and upon admission. **Current students of local Universities, Polytechnics, Junior Colleges, Institutes of Technical Education and Secondary School holding a valid student photo ID are eligible to purchase student ticket. Verification will be done at the point of entry. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 1 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# Standard Rate Adult - SGD 39  |  **Child - SGD 29 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult #Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 2 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# 6. Bouncing Net^# Standard Rate Adult - SGD 54  |  **Child - SGD 39 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 3 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 56  |  **Child - SGD 40 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 4 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# 7. Bouncing Net^# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 71  |  **Child - SGD 50 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES *Terms and Conditions apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy ",
    "word_count": 830
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions/bouncing-net.html",
    "title": "Bouncing Net - Jewel Changi Airport",
    "content": "Bouncing Net - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. ×Close BOUNCING NET FEEL LIKE YOU'RE BOUNCING AMONG TREES Experience the thrill of being almost weightless as you leap about this giant net! At its highest point at 8 metres above the ground, you'll feel like you can reach the sky. OPENING HOURS 10:00AM - 9:00PM Last admission is 30 mins prior to closing time LOCATION Canopy Park (L5) Practical information Recommended attire: - Pants or shorts - Comfortable covered shoes Luggage and wheeled bags are not allowed for safety reasons. Please leave your bags at the Baggage Storage. Bouncing Net Bouncing Net^# ticket includes admission to Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk). Standard Rate Adult - SGD 24.90 Child - SGD 19.90 Singapore Residents* Adult - SGD 20.90 Child/**Student/Senior - SGD 15.90 CapitaStar Members & Changi Rewards Members Special Rate [Available at Jewel Concierge Counters (L1, 2, 5)] Adult - SGD 18.80 Child/**Student/Senior - SGD 14.30 Child: 3 - 12 years old | Senior: 60 years old and above All Child ticket holders must be accompanied by a paying Adult. #Minimum height requirement is 110cm. ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. * Applicable for Singapore citizens, permanent residents, employment pass, work permit and dependent pass holders. Proof of residency may be required at the point of ticket purchase and upon admission. **Current students of local Universities, Polytechnics, Junior Colleges, Institutes of Technical Education and Secondary School holding a valid student photo ID are eligible to purchase student ticket. Verification will be done at the point of entry. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 2 Deal includes: 1. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 2. Mastercard® Canopy Bridge 3. Hedge Maze 4. Mirror Maze 5. Walking Net# 6. Bouncing Net^# Standard Rate Adult - SGD 54  |  **Child - SGD 39 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES Bundle Deal 4 Deal includes: 1. Changi Experience Studio+ 2. Canopy Park (Incl. Discovery Slides#, Foggy Bowls, Petal Garden, Topiary Walk) 3. Mastercard® Canopy Bridge 4. Hedge Maze 5. Mirror Maze 6. Walking Net# 7. Bouncing Net^# Note: Changi Experience Studio opens from 11am to 8pm with last admission at 7pm. Standard Rate Adult - SGD 71  |  **Child - SGD 50 Child: 3 - 12 years old All Child ticket holders must be accompanied by a paying Adult + Attraction is suitable for children aged 6 and above. ^Rates are valid for one 45-min session inclusive of a compulsory safety briefing of estimated 10 mins. # Minimum height requirement is 110cm. **Applicable to both local student and senior. STANDARD RATES STANDARD RATES LOCAL RATES LOCAL RATES *Terms and Conditions apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 668
  },
  {
    "url": "https://www.jewelchangiairport.com/en/promotion/Changi-Reward-Changi-e-Voucher-Flexi.html",
    "title": "Use Your Changi Reward e-Voucher Flexi Now! - Jewel Changi Airport",
    "content": "Use Your Changi Reward e-Voucher Flexi Now! - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Use Your Changi Rewards Changi e-Voucher Flexi Now LOCATION Participating Outlets ×Close 4 / 9 Redeem your Changi e-Voucher Flexi with Changi Rewards points and use it at the participating outlets to offset your purchases! For more information on Changi Rewards Changi e-Voucher Flexi, please click here. Terms and Conditions - Shoppers must be a Changi Rewards Member to use Changi e-Voucher Flexi. - Only Changi e-Voucher Flexi can be used at participating outlets in Jewel Changi Airport. For list of non-participating outlets, please click here. - Changi e-Voucher Flexi cannot be used at the following: - YOTELAIR Singapore Changi Airport - Jewel Attractions tickets - Changi Experience Studio tickets - Temporary vendors at promotional spaces, e.g. Jewel Atrium, Cloud9 Piazza and Pop-up Stores - Banks/ ATMs/ Money Changers/ Financial Services - SISTIC/ AXS/ SAM payments - Cash Card/ Stored Value Cards Top-Up transactions - Lounges, passenger meeting services counters, left luggage service counters, tour and travel services - Online purchases - Car rental services, airport shuttle and transportation counters - Tobacco products - Click here for the list of Frequently Asked Question. - Other terms and conditions by Jewel Changi Airport Devt Pte Ltd, Jewel Double Rewards and Changi Rewards apply. STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 373
  },
  {
    "url": "https://www.jewelchangiairport.com/en/dine.html",
    "title": "Dining & Restaurants - Jewel Changi Airport",
    "content": "Dining & Restaurants - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Dining Experience in Jewel While we strive to ensure that the operating hours of our shops and eateries are updated in a timely manner, we seek your understanding that information may change as a result of operational considerations. To avoid disappointment, we recommend checking with the respective store/eatery on their operating hours. ×Close 4 / 9 View Filters Reset APPLY FILTERS Clear All Load More STAY UPDATED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy, Conditions of Access and Cookie Policy to the placement of cookies on your computer.",
    "word_count": 232
  }
]